Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x85c (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 22 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x1a4e9): GNU C11 12.3.1 20230626 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x5a6bf): ../Core/Src/driver.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x67fd1): C:/Users/Orsted/STM32CubeIDE/workspace_1.17.0/WD17N_DRV/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 6 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x41e4c): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x2681f): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 6 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x1aa92): unsigned char
 <1><44>: Abbrev Number: 6 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x6224c): short int
 <1><4b>: Abbrev Number: 5 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x6bcdc): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 6 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0x2b15f): short unsigned int
 <1><5e>: Abbrev Number: 6 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0xb6ac): long int
 <1><65>: Abbrev Number: 5 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x53d35): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 6 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x1ee4e): long unsigned int
 <1><78>: Abbrev Number: 6 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x3c511): long long int
 <1><7f>: Abbrev Number: 6 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x1b2ba): long long unsigned int
 <1><86>: Abbrev Number: 23 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 6 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xb06f): unsigned int
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x26821): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 5 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x87ab5): uint16_t
    <a5>   DW_AT_decl_file   : 3
    <a6>   DW_AT_decl_line   : 36
    <a7>   DW_AT_decl_column : 20
    <a8>   DW_AT_type        : <0x4b>
 <1><ac>: Abbrev Number: 5 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0x87a95): uint32_t
    <b1>   DW_AT_decl_file   : 3
    <b2>   DW_AT_decl_line   : 48
    <b3>   DW_AT_decl_column : 20
    <b4>   DW_AT_type        : <0x65>
 <1><b8>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <b9>   DW_AT_type        : <0xac>
 <1><bd>: Abbrev Number: 11 (DW_TAG_structure_type)
    <be>   DW_AT_byte_size   : 16
    <bf>   DW_AT_decl_file   : 4
    <c0>   DW_AT_decl_line   : 290
    <c2>   DW_AT_decl_column : 9
    <c2>   DW_AT_sibling     : <0xfd>
 <2><c6>: Abbrev Number: 4 (DW_TAG_member)
    <c7>   DW_AT_name        : CCR
    <cb>   DW_AT_decl_file   : 4
    <cb>   DW_AT_decl_line   : 292
    <cd>   DW_AT_decl_column : 17
    <cd>   DW_AT_type        : <0xb8>
    <d1>   DW_AT_data_member_location: 0
 <2><d2>: Abbrev Number: 2 (DW_TAG_member)
    <d3>   DW_AT_name        : (indirect string, offset: 0x32b7e): CNDTR
    <d7>   DW_AT_decl_file   : 4
    <d8>   DW_AT_decl_line   : 293
    <da>   DW_AT_decl_column : 17
    <db>   DW_AT_type        : <0xb8>
    <df>   DW_AT_data_member_location: 4
 <2><e0>: Abbrev Number: 2 (DW_TAG_member)
    <e1>   DW_AT_name        : (indirect string, offset: 0x7e3dc): CPAR
    <e5>   DW_AT_decl_file   : 4
    <e6>   DW_AT_decl_line   : 294
    <e8>   DW_AT_decl_column : 17
    <e9>   DW_AT_type        : <0xb8>
    <ed>   DW_AT_data_member_location: 8
 <2><ee>: Abbrev Number: 2 (DW_TAG_member)
    <ef>   DW_AT_name        : (indirect string, offset: 0x48903): CMAR
    <f3>   DW_AT_decl_file   : 4
    <f4>   DW_AT_decl_line   : 295
    <f6>   DW_AT_decl_column : 17
    <f7>   DW_AT_type        : <0xb8>
    <fb>   DW_AT_data_member_location: 12
 <2><fc>: Abbrev Number: 0
 <1><fd>: Abbrev Number: 7 (DW_TAG_typedef)
    <fe>   DW_AT_name        : (indirect string, offset: 0x6b4e2): DMA_Channel_TypeDef
    <102>   DW_AT_decl_file   : 4
    <103>   DW_AT_decl_line   : 296
    <105>   DW_AT_decl_column : 3
    <106>   DW_AT_type        : <0xbd>
 <1><10a>: Abbrev Number: 11 (DW_TAG_structure_type)
    <10b>   DW_AT_byte_size   : 8
    <10c>   DW_AT_decl_file   : 4
    <10d>   DW_AT_decl_line   : 298
    <10f>   DW_AT_decl_column : 9
    <10f>   DW_AT_sibling     : <0x12e>
 <2><113>: Abbrev Number: 4 (DW_TAG_member)
    <114>   DW_AT_name        : ISR
    <118>   DW_AT_decl_file   : 4
    <118>   DW_AT_decl_line   : 300
    <11a>   DW_AT_decl_column : 17
    <11a>   DW_AT_type        : <0xb8>
    <11e>   DW_AT_data_member_location: 0
 <2><11f>: Abbrev Number: 2 (DW_TAG_member)
    <120>   DW_AT_name        : (indirect string, offset: 0x5c606): IFCR
    <124>   DW_AT_decl_file   : 4
    <125>   DW_AT_decl_line   : 301
    <127>   DW_AT_decl_column : 17
    <128>   DW_AT_type        : <0xb8>
    <12c>   DW_AT_data_member_location: 4
 <2><12d>: Abbrev Number: 0
 <1><12e>: Abbrev Number: 7 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0x2fc6e): DMA_TypeDef
    <133>   DW_AT_decl_file   : 4
    <134>   DW_AT_decl_line   : 302
    <136>   DW_AT_decl_column : 3
    <137>   DW_AT_type        : <0x10a>
 <1><13b>: Abbrev Number: 11 (DW_TAG_structure_type)
    <13c>   DW_AT_byte_size   : 28
    <13d>   DW_AT_decl_file   : 4
    <13e>   DW_AT_decl_line   : 357
    <140>   DW_AT_decl_column : 9
    <140>   DW_AT_sibling     : <0x19d>
 <2><144>: Abbrev Number: 4 (DW_TAG_member)
    <145>   DW_AT_name        : CRL
    <149>   DW_AT_decl_file   : 4
    <149>   DW_AT_decl_line   : 359
    <14b>   DW_AT_decl_column : 17
    <14b>   DW_AT_type        : <0xb8>
    <14f>   DW_AT_data_member_location: 0
 <2><150>: Abbrev Number: 4 (DW_TAG_member)
    <151>   DW_AT_name        : CRH
    <155>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 360
    <157>   DW_AT_decl_column : 17
    <157>   DW_AT_type        : <0xb8>
    <15b>   DW_AT_data_member_location: 4
 <2><15c>: Abbrev Number: 4 (DW_TAG_member)
    <15d>   DW_AT_name        : IDR
    <161>   DW_AT_decl_file   : 4
    <161>   DW_AT_decl_line   : 361
    <163>   DW_AT_decl_column : 17
    <163>   DW_AT_type        : <0xb8>
    <167>   DW_AT_data_member_location: 8
 <2><168>: Abbrev Number: 4 (DW_TAG_member)
    <169>   DW_AT_name        : ODR
    <16d>   DW_AT_decl_file   : 4
    <16d>   DW_AT_decl_line   : 362
    <16f>   DW_AT_decl_column : 17
    <16f>   DW_AT_type        : <0xb8>
    <173>   DW_AT_data_member_location: 12
 <2><174>: Abbrev Number: 2 (DW_TAG_member)
    <175>   DW_AT_name        : (indirect string, offset: 0x1d5fb): BSRR
    <179>   DW_AT_decl_file   : 4
    <17a>   DW_AT_decl_line   : 363
    <17c>   DW_AT_decl_column : 17
    <17d>   DW_AT_type        : <0xb8>
    <181>   DW_AT_data_member_location: 16
 <2><182>: Abbrev Number: 4 (DW_TAG_member)
    <183>   DW_AT_name        : BRR
    <187>   DW_AT_decl_file   : 4
    <187>   DW_AT_decl_line   : 364
    <189>   DW_AT_decl_column : 17
    <189>   DW_AT_type        : <0xb8>
    <18d>   DW_AT_data_member_location: 20
 <2><18e>: Abbrev Number: 2 (DW_TAG_member)
    <18f>   DW_AT_name        : (indirect string, offset: 0x7102a): LCKR
    <193>   DW_AT_decl_file   : 4
    <194>   DW_AT_decl_line   : 365
    <196>   DW_AT_decl_column : 17
    <197>   DW_AT_type        : <0xb8>
    <19b>   DW_AT_data_member_location: 24
 <2><19c>: Abbrev Number: 0
 <1><19d>: Abbrev Number: 7 (DW_TAG_typedef)
    <19e>   DW_AT_name        : (indirect string, offset: 0x7ee4f): GPIO_TypeDef
    <1a2>   DW_AT_decl_file   : 4
    <1a3>   DW_AT_decl_line   : 366
    <1a5>   DW_AT_decl_column : 3
    <1a6>   DW_AT_type        : <0x13b>
 <1><1aa>: Abbrev Number: 11 (DW_TAG_structure_type)
    <1ab>   DW_AT_byte_size   : 84
    <1ac>   DW_AT_decl_file   : 4
    <1ad>   DW_AT_decl_line   : 476
    <1af>   DW_AT_decl_column : 9
    <1af>   DW_AT_sibling     : <0x2c4>
 <2><1b3>: Abbrev Number: 4 (DW_TAG_member)
    <1b4>   DW_AT_name        : CR1
    <1b8>   DW_AT_decl_file   : 4
    <1b8>   DW_AT_decl_line   : 478
    <1ba>   DW_AT_decl_column : 17
    <1ba>   DW_AT_type        : <0xb8>
    <1be>   DW_AT_data_member_location: 0
 <2><1bf>: Abbrev Number: 4 (DW_TAG_member)
    <1c0>   DW_AT_name        : CR2
    <1c4>   DW_AT_decl_file   : 4
    <1c4>   DW_AT_decl_line   : 479
    <1c6>   DW_AT_decl_column : 17
    <1c6>   DW_AT_type        : <0xb8>
    <1ca>   DW_AT_data_member_location: 4
 <2><1cb>: Abbrev Number: 2 (DW_TAG_member)
    <1cc>   DW_AT_name        : (indirect string, offset: 0x5ec7f): SMCR
    <1d0>   DW_AT_decl_file   : 4
    <1d1>   DW_AT_decl_line   : 480
    <1d3>   DW_AT_decl_column : 17
    <1d4>   DW_AT_type        : <0xb8>
    <1d8>   DW_AT_data_member_location: 8
 <2><1d9>: Abbrev Number: 2 (DW_TAG_member)
    <1da>   DW_AT_name        : (indirect string, offset: 0x2a095): DIER
    <1de>   DW_AT_decl_file   : 4
    <1df>   DW_AT_decl_line   : 481
    <1e1>   DW_AT_decl_column : 17
    <1e2>   DW_AT_type        : <0xb8>
    <1e6>   DW_AT_data_member_location: 12
 <2><1e7>: Abbrev Number: 4 (DW_TAG_member)
    <1e8>   DW_AT_name        : SR
    <1eb>   DW_AT_decl_file   : 4
    <1eb>   DW_AT_decl_line   : 482
    <1ed>   DW_AT_decl_column : 17
    <1ed>   DW_AT_type        : <0xb8>
    <1f1>   DW_AT_data_member_location: 16
 <2><1f2>: Abbrev Number: 4 (DW_TAG_member)
    <1f3>   DW_AT_name        : EGR
    <1f7>   DW_AT_decl_file   : 4
    <1f7>   DW_AT_decl_line   : 483
    <1f9>   DW_AT_decl_column : 17
    <1f9>   DW_AT_type        : <0xb8>
    <1fd>   DW_AT_data_member_location: 20
 <2><1fe>: Abbrev Number: 2 (DW_TAG_member)
    <1ff>   DW_AT_name        : (indirect string, offset: 0x607a2): CCMR1
    <203>   DW_AT_decl_file   : 4
    <204>   DW_AT_decl_line   : 484
    <206>   DW_AT_decl_column : 17
    <207>   DW_AT_type        : <0xb8>
    <20b>   DW_AT_data_member_location: 24
 <2><20c>: Abbrev Number: 2 (DW_TAG_member)
    <20d>   DW_AT_name        : (indirect string, offset: 0x34756): CCMR2
    <211>   DW_AT_decl_file   : 4
    <212>   DW_AT_decl_line   : 485
    <214>   DW_AT_decl_column : 17
    <215>   DW_AT_type        : <0xb8>
    <219>   DW_AT_data_member_location: 28
 <2><21a>: Abbrev Number: 2 (DW_TAG_member)
    <21b>   DW_AT_name        : (indirect string, offset: 0x172b6): CCER
    <21f>   DW_AT_decl_file   : 4
    <220>   DW_AT_decl_line   : 486
    <222>   DW_AT_decl_column : 17
    <223>   DW_AT_type        : <0xb8>
    <227>   DW_AT_data_member_location: 32
 <2><228>: Abbrev Number: 4 (DW_TAG_member)
    <229>   DW_AT_name        : CNT
    <22d>   DW_AT_decl_file   : 4
    <22d>   DW_AT_decl_line   : 487
    <22f>   DW_AT_decl_column : 17
    <22f>   DW_AT_type        : <0xb8>
    <233>   DW_AT_data_member_location: 36
 <2><234>: Abbrev Number: 4 (DW_TAG_member)
    <235>   DW_AT_name        : PSC
    <239>   DW_AT_decl_file   : 4
    <239>   DW_AT_decl_line   : 488
    <23b>   DW_AT_decl_column : 17
    <23b>   DW_AT_type        : <0xb8>
    <23f>   DW_AT_data_member_location: 40
 <2><240>: Abbrev Number: 4 (DW_TAG_member)
    <241>   DW_AT_name        : ARR
    <245>   DW_AT_decl_file   : 4
    <245>   DW_AT_decl_line   : 489
    <247>   DW_AT_decl_column : 17
    <247>   DW_AT_type        : <0xb8>
    <24b>   DW_AT_data_member_location: 44
 <2><24c>: Abbrev Number: 4 (DW_TAG_member)
    <24d>   DW_AT_name        : RCR
    <251>   DW_AT_decl_file   : 4
    <251>   DW_AT_decl_line   : 490
    <253>   DW_AT_decl_column : 17
    <253>   DW_AT_type        : <0xb8>
    <257>   DW_AT_data_member_location: 48
 <2><258>: Abbrev Number: 2 (DW_TAG_member)
    <259>   DW_AT_name        : (indirect string, offset: 0xfa92): CCR1
    <25d>   DW_AT_decl_file   : 4
    <25e>   DW_AT_decl_line   : 491
    <260>   DW_AT_decl_column : 17
    <261>   DW_AT_type        : <0xb8>
    <265>   DW_AT_data_member_location: 52
 <2><266>: Abbrev Number: 2 (DW_TAG_member)
    <267>   DW_AT_name        : (indirect string, offset: 0x37787): CCR2
    <26b>   DW_AT_decl_file   : 4
    <26c>   DW_AT_decl_line   : 492
    <26e>   DW_AT_decl_column : 17
    <26f>   DW_AT_type        : <0xb8>
    <273>   DW_AT_data_member_location: 56
 <2><274>: Abbrev Number: 2 (DW_TAG_member)
    <275>   DW_AT_name        : (indirect string, offset: 0x64e91): CCR3
    <279>   DW_AT_decl_file   : 4
    <27a>   DW_AT_decl_line   : 493
    <27c>   DW_AT_decl_column : 17
    <27d>   DW_AT_type        : <0xb8>
    <281>   DW_AT_data_member_location: 60
 <2><282>: Abbrev Number: 2 (DW_TAG_member)
    <283>   DW_AT_name        : (indirect string, offset: 0x85b2): CCR4
    <287>   DW_AT_decl_file   : 4
    <288>   DW_AT_decl_line   : 494
    <28a>   DW_AT_decl_column : 17
    <28b>   DW_AT_type        : <0xb8>
    <28f>   DW_AT_data_member_location: 64
 <2><290>: Abbrev Number: 2 (DW_TAG_member)
    <291>   DW_AT_name        : (indirect string, offset: 0x3cde8): BDTR
    <295>   DW_AT_decl_file   : 4
    <296>   DW_AT_decl_line   : 495
    <298>   DW_AT_decl_column : 17
    <299>   DW_AT_type        : <0xb8>
    <29d>   DW_AT_data_member_location: 68
 <2><29e>: Abbrev Number: 4 (DW_TAG_member)
    <29f>   DW_AT_name        : DCR
    <2a3>   DW_AT_decl_file   : 4
    <2a3>   DW_AT_decl_line   : 496
    <2a5>   DW_AT_decl_column : 17
    <2a5>   DW_AT_type        : <0xb8>
    <2a9>   DW_AT_data_member_location: 72
 <2><2aa>: Abbrev Number: 2 (DW_TAG_member)
    <2ab>   DW_AT_name        : (indirect string, offset: 0x713a7): DMAR
    <2af>   DW_AT_decl_file   : 4
    <2b0>   DW_AT_decl_line   : 497
    <2b2>   DW_AT_decl_column : 17
    <2b3>   DW_AT_type        : <0xb8>
    <2b7>   DW_AT_data_member_location: 76
 <2><2b8>: Abbrev Number: 4 (DW_TAG_member)
    <2b9>   DW_AT_name        : OR
    <2bc>   DW_AT_decl_file   : 4
    <2bc>   DW_AT_decl_line   : 498
    <2be>   DW_AT_decl_column : 17
    <2be>   DW_AT_type        : <0xb8>
    <2c2>   DW_AT_data_member_location: 80
 <2><2c3>: Abbrev Number: 0
 <1><2c4>: Abbrev Number: 7 (DW_TAG_typedef)
    <2c5>   DW_AT_name        : (indirect string, offset: 0x1c02d): TIM_TypeDef
    <2c9>   DW_AT_decl_file   : 4
    <2ca>   DW_AT_decl_line   : 499
    <2cc>   DW_AT_decl_column : 2
    <2cd>   DW_AT_type        : <0x1aa>
 <1><2d1>: Abbrev Number: 6 (DW_TAG_base_type)
    <2d2>   DW_AT_byte_size   : 8
    <2d3>   DW_AT_encoding    : 4	(float)
    <2d4>   DW_AT_name        : (indirect string, offset: 0x842ac): long double
 <1><2d8>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <2d9>   DW_AT_encoding    : 7	(unsigned)
    <2d9>   DW_AT_byte_size   : 1
    <2d9>   DW_AT_type        : <0x3d>
    <2dd>   DW_AT_decl_file   : 5
    <2de>   DW_AT_decl_line   : 39
    <2df>   DW_AT_decl_column : 1
    <2df>   DW_AT_sibling     : <0x2fc>
 <2><2e3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2e4>   DW_AT_name        : (indirect string, offset: 0x2c758): HAL_OK
    <2e8>   DW_AT_const_value : 0
 <2><2e9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2ea>   DW_AT_name        : (indirect string, offset: 0x52648): HAL_ERROR
    <2ee>   DW_AT_const_value : 1
 <2><2ef>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2f0>   DW_AT_name        : (indirect string, offset: 0x16e99): HAL_BUSY
    <2f4>   DW_AT_const_value : 2
 <2><2f5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2f6>   DW_AT_name        : (indirect string, offset: 0x26c9e): HAL_TIMEOUT
    <2fa>   DW_AT_const_value : 3
 <2><2fb>: Abbrev Number: 0
 <1><2fc>: Abbrev Number: 5 (DW_TAG_typedef)
    <2fd>   DW_AT_name        : (indirect string, offset: 0x1908): HAL_StatusTypeDef
    <301>   DW_AT_decl_file   : 5
    <302>   DW_AT_decl_line   : 44
    <303>   DW_AT_decl_column : 3
    <304>   DW_AT_type        : <0x2d8>
 <1><308>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <309>   DW_AT_encoding    : 7	(unsigned)
    <309>   DW_AT_byte_size   : 1
    <309>   DW_AT_type        : <0x3d>
    <30d>   DW_AT_decl_file   : 5
    <30e>   DW_AT_decl_line   : 50
    <30f>   DW_AT_decl_column : 1
    <30f>   DW_AT_sibling     : <0x320>
 <2><313>: Abbrev Number: 1 (DW_TAG_enumerator)
    <314>   DW_AT_name        : (indirect string, offset: 0x615ef): HAL_UNLOCKED
    <318>   DW_AT_const_value : 0
 <2><319>: Abbrev Number: 1 (DW_TAG_enumerator)
    <31a>   DW_AT_name        : (indirect string, offset: 0x82b3a): HAL_LOCKED
    <31e>   DW_AT_const_value : 1
 <2><31f>: Abbrev Number: 0
 <1><320>: Abbrev Number: 5 (DW_TAG_typedef)
    <321>   DW_AT_name        : (indirect string, offset: 0x4d6b6): HAL_LockTypeDef
    <325>   DW_AT_decl_file   : 5
    <326>   DW_AT_decl_line   : 53
    <327>   DW_AT_decl_column : 3
    <328>   DW_AT_type        : <0x308>
 <1><32c>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <32d>   DW_AT_encoding    : 7	(unsigned)
    <32d>   DW_AT_byte_size   : 1
    <32d>   DW_AT_type        : <0x3d>
    <331>   DW_AT_decl_file   : 6
    <332>   DW_AT_decl_line   : 65
    <333>   DW_AT_decl_column : 1
    <333>   DW_AT_sibling     : <0x344>
 <2><337>: Abbrev Number: 1 (DW_TAG_enumerator)
    <338>   DW_AT_name        : (indirect string, offset: 0x1afee): GPIO_PIN_RESET
    <33c>   DW_AT_const_value : 0
 <2><33d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <33e>   DW_AT_name        : (indirect string, offset: 0x17111): GPIO_PIN_SET
    <342>   DW_AT_const_value : 1
 <2><343>: Abbrev Number: 0
 <1><344>: Abbrev Number: 5 (DW_TAG_typedef)
    <345>   DW_AT_name        : (indirect string, offset: 0x80580): GPIO_PinState
    <349>   DW_AT_decl_file   : 6
    <34a>   DW_AT_decl_line   : 68
    <34b>   DW_AT_decl_column : 3
    <34c>   DW_AT_type        : <0x32c>
 <1><350>: Abbrev Number: 17 (DW_TAG_structure_type)
    <351>   DW_AT_byte_size   : 28
    <352>   DW_AT_decl_file   : 7
    <353>   DW_AT_decl_line   : 47
    <354>   DW_AT_decl_column : 9
    <354>   DW_AT_sibling     : <0x3b4>
 <2><358>: Abbrev Number: 3 (DW_TAG_member)
    <359>   DW_AT_name        : (indirect string, offset: 0x8d808): Direction
    <35d>   DW_AT_decl_file   : 7
    <35e>   DW_AT_decl_line   : 49
    <35f>   DW_AT_decl_column : 12
    <360>   DW_AT_type        : <0xac>
    <364>   DW_AT_data_member_location: 0
 <2><365>: Abbrev Number: 3 (DW_TAG_member)
    <366>   DW_AT_name        : (indirect string, offset: 0x8e74): PeriphInc
    <36a>   DW_AT_decl_file   : 7
    <36b>   DW_AT_decl_line   : 53
    <36c>   DW_AT_decl_column : 12
    <36d>   DW_AT_type        : <0xac>
    <371>   DW_AT_data_member_location: 4
 <2><372>: Abbrev Number: 3 (DW_TAG_member)
    <373>   DW_AT_name        : (indirect string, offset: 0x14946): MemInc
    <377>   DW_AT_decl_file   : 7
    <378>   DW_AT_decl_line   : 56
    <379>   DW_AT_decl_column : 12
    <37a>   DW_AT_type        : <0xac>
    <37e>   DW_AT_data_member_location: 8
 <2><37f>: Abbrev Number: 3 (DW_TAG_member)
    <380>   DW_AT_name        : (indirect string, offset: 0x41752): PeriphDataAlignment
    <384>   DW_AT_decl_file   : 7
    <385>   DW_AT_decl_line   : 59
    <386>   DW_AT_decl_column : 12
    <387>   DW_AT_type        : <0xac>
    <38b>   DW_AT_data_member_location: 12
 <2><38c>: Abbrev Number: 3 (DW_TAG_member)
    <38d>   DW_AT_name        : (indirect string, offset: 0x76a2d): MemDataAlignment
    <391>   DW_AT_decl_file   : 7
    <392>   DW_AT_decl_line   : 62
    <393>   DW_AT_decl_column : 12
    <394>   DW_AT_type        : <0xac>
    <398>   DW_AT_data_member_location: 16
 <2><399>: Abbrev Number: 3 (DW_TAG_member)
    <39a>   DW_AT_name        : (indirect string, offset: 0x8a929): Mode
    <39e>   DW_AT_decl_file   : 7
    <39f>   DW_AT_decl_line   : 65
    <3a0>   DW_AT_decl_column : 12
    <3a1>   DW_AT_type        : <0xac>
    <3a5>   DW_AT_data_member_location: 20
 <2><3a6>: Abbrev Number: 3 (DW_TAG_member)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x8cc03): Priority
    <3ab>   DW_AT_decl_file   : 7
    <3ac>   DW_AT_decl_line   : 70
    <3ad>   DW_AT_decl_column : 12
    <3ae>   DW_AT_type        : <0xac>
    <3b2>   DW_AT_data_member_location: 24
 <2><3b3>: Abbrev Number: 0
 <1><3b4>: Abbrev Number: 5 (DW_TAG_typedef)
    <3b5>   DW_AT_name        : (indirect string, offset: 0x2329b): DMA_InitTypeDef
    <3b9>   DW_AT_decl_file   : 7
    <3ba>   DW_AT_decl_line   : 72
    <3bb>   DW_AT_decl_column : 3
    <3bc>   DW_AT_type        : <0x350>
 <1><3c0>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <3c1>   DW_AT_encoding    : 7	(unsigned)
    <3c1>   DW_AT_byte_size   : 1
    <3c1>   DW_AT_type        : <0x3d>
    <3c5>   DW_AT_decl_file   : 7
    <3c6>   DW_AT_decl_line   : 78
    <3c7>   DW_AT_decl_column : 1
    <3c7>   DW_AT_sibling     : <0x3e4>
 <2><3cb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3cc>   DW_AT_name        : (indirect string, offset: 0x624de): HAL_DMA_STATE_RESET
    <3d0>   DW_AT_const_value : 0
 <2><3d1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3d2>   DW_AT_name        : (indirect string, offset: 0x23f8b): HAL_DMA_STATE_READY
    <3d6>   DW_AT_const_value : 1
 <2><3d7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3d8>   DW_AT_name        : (indirect string, offset: 0x5b77e): HAL_DMA_STATE_BUSY
    <3dc>   DW_AT_const_value : 2
 <2><3dd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3de>   DW_AT_name        : (indirect string, offset: 0x8085f): HAL_DMA_STATE_TIMEOUT
    <3e2>   DW_AT_const_value : 3
 <2><3e3>: Abbrev Number: 0
 <1><3e4>: Abbrev Number: 5 (DW_TAG_typedef)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x57ed9): HAL_DMA_StateTypeDef
    <3e9>   DW_AT_decl_file   : 7
    <3ea>   DW_AT_decl_line   : 83
    <3eb>   DW_AT_decl_column : 2
    <3ec>   DW_AT_type        : <0x3c0>
 <1><3f0>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <3f1>   DW_AT_type        : <0x3e4>
 <1><3f5>: Abbrev Number: 24 (DW_TAG_structure_type)
    <3f6>   DW_AT_name        : (indirect string, offset: 0x7041e): __DMA_HandleTypeDef
    <3fa>   DW_AT_byte_size   : 68
    <3fb>   DW_AT_decl_file   : 7
    <3fc>   DW_AT_decl_line   : 110
    <3fd>   DW_AT_decl_column : 16
    <3fe>   DW_AT_sibling     : <0x49f>
 <2><402>: Abbrev Number: 3 (DW_TAG_member)
    <403>   DW_AT_name        : (indirect string, offset: 0x331c9): Instance
    <407>   DW_AT_decl_file   : 7
    <408>   DW_AT_decl_line   : 112
    <409>   DW_AT_decl_column : 31
    <40a>   DW_AT_type        : <0x49f>
    <40e>   DW_AT_data_member_location: 0
 <2><40f>: Abbrev Number: 3 (DW_TAG_member)
    <410>   DW_AT_name        : (indirect string, offset: 0x8ba18): Init
    <414>   DW_AT_decl_file   : 7
    <415>   DW_AT_decl_line   : 114
    <416>   DW_AT_decl_column : 30
    <417>   DW_AT_type        : <0x3b4>
    <41b>   DW_AT_data_member_location: 4
 <2><41c>: Abbrev Number: 3 (DW_TAG_member)
    <41d>   DW_AT_name        : (indirect string, offset: 0x5e086): Lock
    <421>   DW_AT_decl_file   : 7
    <422>   DW_AT_decl_line   : 116
    <423>   DW_AT_decl_column : 30
    <424>   DW_AT_type        : <0x320>
    <428>   DW_AT_data_member_location: 32
 <2><429>: Abbrev Number: 3 (DW_TAG_member)
    <42a>   DW_AT_name        : (indirect string, offset: 0x8b3ae): State
    <42e>   DW_AT_decl_file   : 7
    <42f>   DW_AT_decl_line   : 118
    <430>   DW_AT_decl_column : 30
    <431>   DW_AT_type        : <0x3f0>
    <435>   DW_AT_data_member_location: 33
 <2><436>: Abbrev Number: 3 (DW_TAG_member)
    <437>   DW_AT_name        : (indirect string, offset: 0x7c688): Parent
    <43b>   DW_AT_decl_file   : 7
    <43c>   DW_AT_decl_line   : 120
    <43d>   DW_AT_decl_column : 31
    <43e>   DW_AT_type        : <0x4a4>
    <442>   DW_AT_data_member_location: 36
 <2><443>: Abbrev Number: 3 (DW_TAG_member)
    <444>   DW_AT_name        : (indirect string, offset: 0x82187): XferCpltCallback
    <448>   DW_AT_decl_file   : 7
    <449>   DW_AT_decl_line   : 122
    <44a>   DW_AT_decl_column : 33
    <44b>   DW_AT_type        : <0x4b6>
    <44f>   DW_AT_data_member_location: 40
 <2><450>: Abbrev Number: 3 (DW_TAG_member)
    <451>   DW_AT_name        : (indirect string, offset: 0x666ec): XferHalfCpltCallback
    <455>   DW_AT_decl_file   : 7
    <456>   DW_AT_decl_line   : 124
    <457>   DW_AT_decl_column : 33
    <458>   DW_AT_type        : <0x4b6>
    <45c>   DW_AT_data_member_location: 44
 <2><45d>: Abbrev Number: 3 (DW_TAG_member)
    <45e>   DW_AT_name        : (indirect string, offset: 0x12d1b): XferErrorCallback
    <462>   DW_AT_decl_file   : 7
    <463>   DW_AT_decl_line   : 126
    <464>   DW_AT_decl_column : 33
    <465>   DW_AT_type        : <0x4b6>
    <469>   DW_AT_data_member_location: 48
 <2><46a>: Abbrev Number: 3 (DW_TAG_member)
    <46b>   DW_AT_name        : (indirect string, offset: 0x7a2e9): XferAbortCallback
    <46f>   DW_AT_decl_file   : 7
    <470>   DW_AT_decl_line   : 128
    <471>   DW_AT_decl_column : 33
    <472>   DW_AT_type        : <0x4b6>
    <476>   DW_AT_data_member_location: 52
 <2><477>: Abbrev Number: 3 (DW_TAG_member)
    <478>   DW_AT_name        : (indirect string, offset: 0x7fbdd): ErrorCode
    <47c>   DW_AT_decl_file   : 7
    <47d>   DW_AT_decl_line   : 130
    <47e>   DW_AT_decl_column : 30
    <47f>   DW_AT_type        : <0xb8>
    <483>   DW_AT_data_member_location: 56
 <2><484>: Abbrev Number: 3 (DW_TAG_member)
    <485>   DW_AT_name        : (indirect string, offset: 0x38530): DmaBaseAddress
    <489>   DW_AT_decl_file   : 7
    <48a>   DW_AT_decl_line   : 132
    <48b>   DW_AT_decl_column : 31
    <48c>   DW_AT_type        : <0x4bb>
    <490>   DW_AT_data_member_location: 60
 <2><491>: Abbrev Number: 3 (DW_TAG_member)
    <492>   DW_AT_name        : (indirect string, offset: 0x1b07f): ChannelIndex
    <496>   DW_AT_decl_file   : 7
    <497>   DW_AT_decl_line   : 134
    <498>   DW_AT_decl_column : 30
    <499>   DW_AT_type        : <0xac>
    <49d>   DW_AT_data_member_location: 64
 <2><49e>: Abbrev Number: 0
 <1><49f>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <4a0>   DW_AT_byte_size   : 4
    <4a0>   DW_AT_type        : <0xfd>
 <1><4a4>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <4a5>   DW_AT_byte_size   : 4
 <1><4a6>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <4a7>   DW_AT_prototyped  : 1
    <4a7>   DW_AT_sibling     : <0x4b1>
 <2><4ab>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <4ac>   DW_AT_type        : <0x4b1>
 <2><4b0>: Abbrev Number: 0
 <1><4b1>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <4b2>   DW_AT_byte_size   : 4
    <4b2>   DW_AT_type        : <0x3f5>
 <1><4b6>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <4b7>   DW_AT_byte_size   : 4
    <4b7>   DW_AT_type        : <0x4a6>
 <1><4bb>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <4bc>   DW_AT_byte_size   : 4
    <4bc>   DW_AT_type        : <0x12e>
 <1><4c0>: Abbrev Number: 5 (DW_TAG_typedef)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x70420): DMA_HandleTypeDef
    <4c5>   DW_AT_decl_file   : 7
    <4c6>   DW_AT_decl_line   : 136
    <4c7>   DW_AT_decl_column : 3
    <4c8>   DW_AT_type        : <0x3f5>
 <1><4cc>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <4cd>   DW_AT_byte_size   : 4
    <4cd>   DW_AT_type        : <0x4c0>
 <1><4d1>: Abbrev Number: 17 (DW_TAG_structure_type)
    <4d2>   DW_AT_byte_size   : 24
    <4d3>   DW_AT_decl_file   : 8
    <4d4>   DW_AT_decl_line   : 46
    <4d5>   DW_AT_decl_column : 9
    <4d5>   DW_AT_sibling     : <0x528>
 <2><4d9>: Abbrev Number: 3 (DW_TAG_member)
    <4da>   DW_AT_name        : (indirect string, offset: 0x8e438): Prescaler
    <4de>   DW_AT_decl_file   : 8
    <4df>   DW_AT_decl_line   : 48
    <4e0>   DW_AT_decl_column : 12
    <4e1>   DW_AT_type        : <0xac>
    <4e5>   DW_AT_data_member_location: 0
 <2><4e6>: Abbrev Number: 3 (DW_TAG_member)
    <4e7>   DW_AT_name        : (indirect string, offset: 0x77224): CounterMode
    <4eb>   DW_AT_decl_file   : 8
    <4ec>   DW_AT_decl_line   : 51
    <4ed>   DW_AT_decl_column : 12
    <4ee>   DW_AT_type        : <0xac>
    <4f2>   DW_AT_data_member_location: 4
 <2><4f3>: Abbrev Number: 3 (DW_TAG_member)
    <4f4>   DW_AT_name        : (indirect string, offset: 0x66db4): Period
    <4f8>   DW_AT_decl_file   : 8
    <4f9>   DW_AT_decl_line   : 54
    <4fa>   DW_AT_decl_column : 12
    <4fb>   DW_AT_type        : <0xac>
    <4ff>   DW_AT_data_member_location: 8
 <2><500>: Abbrev Number: 3 (DW_TAG_member)
    <501>   DW_AT_name        : (indirect string, offset: 0x358fb): ClockDivision
    <505>   DW_AT_decl_file   : 8
    <506>   DW_AT_decl_line   : 58
    <507>   DW_AT_decl_column : 12
    <508>   DW_AT_type        : <0xac>
    <50c>   DW_AT_data_member_location: 12
 <2><50d>: Abbrev Number: 3 (DW_TAG_member)
    <50e>   DW_AT_name        : (indirect string, offset: 0x5c6de): RepetitionCounter
    <512>   DW_AT_decl_file   : 8
    <513>   DW_AT_decl_line   : 61
    <514>   DW_AT_decl_column : 12
    <515>   DW_AT_type        : <0xac>
    <519>   DW_AT_data_member_location: 16
 <2><51a>: Abbrev Number: 3 (DW_TAG_member)
    <51b>   DW_AT_name        : (indirect string, offset: 0xd4a6): AutoReloadPreload
    <51f>   DW_AT_decl_file   : 8
    <520>   DW_AT_decl_line   : 72
    <521>   DW_AT_decl_column : 12
    <522>   DW_AT_type        : <0xac>
    <526>   DW_AT_data_member_location: 20
 <2><527>: Abbrev Number: 0
 <1><528>: Abbrev Number: 5 (DW_TAG_typedef)
    <529>   DW_AT_name        : (indirect string, offset: 0x75af0): TIM_Base_InitTypeDef
    <52d>   DW_AT_decl_file   : 8
    <52e>   DW_AT_decl_line   : 74
    <52f>   DW_AT_decl_column : 3
    <530>   DW_AT_type        : <0x4d1>
 <1><534>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <535>   DW_AT_encoding    : 7	(unsigned)
    <535>   DW_AT_byte_size   : 1
    <535>   DW_AT_type        : <0x3d>
    <539>   DW_AT_decl_file   : 8
    <539>   DW_AT_decl_line   : 291
    <53b>   DW_AT_decl_column : 1
    <53b>   DW_AT_sibling     : <0x55e>
 <2><53f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <540>   DW_AT_name        : (indirect string, offset: 0x424c9): HAL_TIM_STATE_RESET
    <544>   DW_AT_const_value : 0
 <2><545>: Abbrev Number: 1 (DW_TAG_enumerator)
    <546>   DW_AT_name        : (indirect string, offset: 0x4d67): HAL_TIM_STATE_READY
    <54a>   DW_AT_const_value : 1
 <2><54b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <54c>   DW_AT_name        : (indirect string, offset: 0x20f68): HAL_TIM_STATE_BUSY
    <550>   DW_AT_const_value : 2
 <2><551>: Abbrev Number: 1 (DW_TAG_enumerator)
    <552>   DW_AT_name        : (indirect string, offset: 0x6e540): HAL_TIM_STATE_TIMEOUT
    <556>   DW_AT_const_value : 3
 <2><557>: Abbrev Number: 1 (DW_TAG_enumerator)
    <558>   DW_AT_name        : (indirect string, offset: 0x30085): HAL_TIM_STATE_ERROR
    <55c>   DW_AT_const_value : 4
 <2><55d>: Abbrev Number: 0
 <1><55e>: Abbrev Number: 7 (DW_TAG_typedef)
    <55f>   DW_AT_name        : (indirect string, offset: 0x5f8fe): HAL_TIM_StateTypeDef
    <563>   DW_AT_decl_file   : 8
    <564>   DW_AT_decl_line   : 297
    <566>   DW_AT_decl_column : 3
    <567>   DW_AT_type        : <0x534>
 <1><56b>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <56c>   DW_AT_type        : <0x55e>
 <1><570>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <571>   DW_AT_encoding    : 7	(unsigned)
    <571>   DW_AT_byte_size   : 1
    <571>   DW_AT_type        : <0x3d>
    <575>   DW_AT_decl_file   : 8
    <575>   DW_AT_decl_line   : 303
    <577>   DW_AT_decl_column : 1
    <577>   DW_AT_sibling     : <0x58e>
 <2><57b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <57c>   DW_AT_name        : (indirect string, offset: 0x2edde): HAL_TIM_CHANNEL_STATE_RESET
    <580>   DW_AT_const_value : 0
 <2><581>: Abbrev Number: 1 (DW_TAG_enumerator)
    <582>   DW_AT_name        : (indirect string, offset: 0x4d274): HAL_TIM_CHANNEL_STATE_READY
    <586>   DW_AT_const_value : 1
 <2><587>: Abbrev Number: 1 (DW_TAG_enumerator)
    <588>   DW_AT_name        : (indirect string, offset: 0x3f873): HAL_TIM_CHANNEL_STATE_BUSY
    <58c>   DW_AT_const_value : 2
 <2><58d>: Abbrev Number: 0
 <1><58e>: Abbrev Number: 7 (DW_TAG_typedef)
    <58f>   DW_AT_name        : (indirect string, offset: 0x1b638): HAL_TIM_ChannelStateTypeDef
    <593>   DW_AT_decl_file   : 8
    <594>   DW_AT_decl_line   : 307
    <596>   DW_AT_decl_column : 3
    <597>   DW_AT_type        : <0x570>
 <1><59b>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <59c>   DW_AT_type        : <0x58e>
 <1><5a0>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <5a1>   DW_AT_encoding    : 7	(unsigned)
    <5a1>   DW_AT_byte_size   : 1
    <5a1>   DW_AT_type        : <0x3d>
    <5a5>   DW_AT_decl_file   : 8
    <5a5>   DW_AT_decl_line   : 313
    <5a7>   DW_AT_decl_column : 1
    <5a7>   DW_AT_sibling     : <0x5be>
 <2><5ab>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5ac>   DW_AT_name        : (indirect string, offset: 0x2b0c): HAL_DMA_BURST_STATE_RESET
    <5b0>   DW_AT_const_value : 0
 <2><5b1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x486e7): HAL_DMA_BURST_STATE_READY
    <5b6>   DW_AT_const_value : 1
 <2><5b7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5b8>   DW_AT_name        : (indirect string, offset: 0x62e3d): HAL_DMA_BURST_STATE_BUSY
    <5bc>   DW_AT_const_value : 2
 <2><5bd>: Abbrev Number: 0
 <1><5be>: Abbrev Number: 7 (DW_TAG_typedef)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x11a18): HAL_TIM_DMABurstStateTypeDef
    <5c3>   DW_AT_decl_file   : 8
    <5c4>   DW_AT_decl_line   : 317
    <5c6>   DW_AT_decl_column : 3
    <5c7>   DW_AT_type        : <0x5a0>
 <1><5cb>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <5cc>   DW_AT_type        : <0x5be>
 <1><5d0>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <5d1>   DW_AT_encoding    : 7	(unsigned)
    <5d1>   DW_AT_byte_size   : 1
    <5d1>   DW_AT_type        : <0x3d>
    <5d5>   DW_AT_decl_file   : 8
    <5d5>   DW_AT_decl_line   : 323
    <5d7>   DW_AT_decl_column : 1
    <5d7>   DW_AT_sibling     : <0x5fa>
 <2><5db>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5dc>   DW_AT_name        : (indirect string, offset: 0x49ba6): HAL_TIM_ACTIVE_CHANNEL_1
    <5e0>   DW_AT_const_value : 1
 <2><5e1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5e2>   DW_AT_name        : (indirect string, offset: 0x49bbf): HAL_TIM_ACTIVE_CHANNEL_2
    <5e6>   DW_AT_const_value : 2
 <2><5e7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5e8>   DW_AT_name        : (indirect string, offset: 0x49bd8): HAL_TIM_ACTIVE_CHANNEL_3
    <5ec>   DW_AT_const_value : 4
 <2><5ed>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5ee>   DW_AT_name        : (indirect string, offset: 0x49bf1): HAL_TIM_ACTIVE_CHANNEL_4
    <5f2>   DW_AT_const_value : 8
 <2><5f3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5f4>   DW_AT_name        : (indirect string, offset: 0x364cd): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <5f8>   DW_AT_const_value : 0
 <2><5f9>: Abbrev Number: 0
 <1><5fa>: Abbrev Number: 7 (DW_TAG_typedef)
    <5fb>   DW_AT_name        : (indirect string, offset: 0x1a8fb): HAL_TIM_ActiveChannel
    <5ff>   DW_AT_decl_file   : 8
    <600>   DW_AT_decl_line   : 329
    <602>   DW_AT_decl_column : 3
    <603>   DW_AT_type        : <0x5d0>
 <1><607>: Abbrev Number: 11 (DW_TAG_structure_type)
    <608>   DW_AT_byte_size   : 72
    <609>   DW_AT_decl_file   : 8
    <60a>   DW_AT_decl_line   : 337
    <60c>   DW_AT_decl_column : 9
    <60c>   DW_AT_sibling     : <0x68f>
 <2><610>: Abbrev Number: 2 (DW_TAG_member)
    <611>   DW_AT_name        : (indirect string, offset: 0x331c9): Instance
    <615>   DW_AT_decl_file   : 8
    <616>   DW_AT_decl_line   : 340
    <618>   DW_AT_decl_column : 39
    <619>   DW_AT_type        : <0x68f>
    <61d>   DW_AT_data_member_location: 0
 <2><61e>: Abbrev Number: 2 (DW_TAG_member)
    <61f>   DW_AT_name        : (indirect string, offset: 0x8ba18): Init
    <623>   DW_AT_decl_file   : 8
    <624>   DW_AT_decl_line   : 341
    <626>   DW_AT_decl_column : 38
    <627>   DW_AT_type        : <0x528>
    <62b>   DW_AT_data_member_location: 4
 <2><62c>: Abbrev Number: 2 (DW_TAG_member)
    <62d>   DW_AT_name        : (indirect string, offset: 0x1a909): Channel
    <631>   DW_AT_decl_file   : 8
    <632>   DW_AT_decl_line   : 342
    <634>   DW_AT_decl_column : 38
    <635>   DW_AT_type        : <0x5fa>
    <639>   DW_AT_data_member_location: 28
 <2><63a>: Abbrev Number: 2 (DW_TAG_member)
    <63b>   DW_AT_name        : (indirect string, offset: 0x4ef7a): hdma
    <63f>   DW_AT_decl_file   : 8
    <640>   DW_AT_decl_line   : 343
    <642>   DW_AT_decl_column : 39
    <643>   DW_AT_type        : <0x694>
    <647>   DW_AT_data_member_location: 32
 <2><648>: Abbrev Number: 2 (DW_TAG_member)
    <649>   DW_AT_name        : (indirect string, offset: 0x5e086): Lock
    <64d>   DW_AT_decl_file   : 8
    <64e>   DW_AT_decl_line   : 345
    <650>   DW_AT_decl_column : 38
    <651>   DW_AT_type        : <0x320>
    <655>   DW_AT_data_member_location: 60
 <2><656>: Abbrev Number: 2 (DW_TAG_member)
    <657>   DW_AT_name        : (indirect string, offset: 0x8b3ae): State
    <65b>   DW_AT_decl_file   : 8
    <65c>   DW_AT_decl_line   : 346
    <65e>   DW_AT_decl_column : 38
    <65f>   DW_AT_type        : <0x56b>
    <663>   DW_AT_data_member_location: 61
 <2><664>: Abbrev Number: 2 (DW_TAG_member)
    <665>   DW_AT_name        : (indirect string, offset: 0x8e8fb): ChannelState
    <669>   DW_AT_decl_file   : 8
    <66a>   DW_AT_decl_line   : 347
    <66c>   DW_AT_decl_column : 38
    <66d>   DW_AT_type        : <0x6b4>
    <671>   DW_AT_data_member_location: 62
 <2><672>: Abbrev Number: 2 (DW_TAG_member)
    <673>   DW_AT_name        : (indirect string, offset: 0x8ee8e): ChannelNState
    <677>   DW_AT_decl_file   : 8
    <678>   DW_AT_decl_line   : 348
    <67a>   DW_AT_decl_column : 38
    <67b>   DW_AT_type        : <0x6b4>
    <67f>   DW_AT_data_member_location: 66
 <2><680>: Abbrev Number: 2 (DW_TAG_member)
    <681>   DW_AT_name        : (indirect string, offset: 0x8e4f9): DMABurstState
    <685>   DW_AT_decl_file   : 8
    <686>   DW_AT_decl_line   : 349
    <688>   DW_AT_decl_column : 38
    <689>   DW_AT_type        : <0x5cb>
    <68d>   DW_AT_data_member_location: 70
 <2><68e>: Abbrev Number: 0
 <1><68f>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <690>   DW_AT_byte_size   : 4
    <690>   DW_AT_type        : <0x2c4>
 <1><694>: Abbrev Number: 18 (DW_TAG_array_type)
    <695>   DW_AT_type        : <0x4cc>
    <699>   DW_AT_sibling     : <0x6a4>
 <2><69d>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <69e>   DW_AT_type        : <0x8d>
    <6a2>   DW_AT_upper_bound : 6
 <2><6a3>: Abbrev Number: 0
 <1><6a4>: Abbrev Number: 18 (DW_TAG_array_type)
    <6a5>   DW_AT_type        : <0x59b>
    <6a9>   DW_AT_sibling     : <0x6b4>
 <2><6ad>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <6ae>   DW_AT_type        : <0x8d>
    <6b2>   DW_AT_upper_bound : 3
 <2><6b3>: Abbrev Number: 0
 <1><6b4>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <6b5>   DW_AT_type        : <0x6a4>
 <1><6b9>: Abbrev Number: 7 (DW_TAG_typedef)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x2d43b): TIM_HandleTypeDef
    <6be>   DW_AT_decl_file   : 8
    <6bf>   DW_AT_decl_line   : 380
    <6c1>   DW_AT_decl_column : 3
    <6c2>   DW_AT_type        : <0x607>
 <1><6c6>: Abbrev Number: 27 (DW_TAG_variable)
    <6c7>   DW_AT_name        : (indirect string, offset: 0x501a4): htim2
    <6cb>   DW_AT_decl_file   : 1
    <6cc>   DW_AT_decl_line   : 3
    <6cd>   DW_AT_decl_column : 26
    <6ce>   DW_AT_type        : <0x6b9>
    <6d2>   DW_AT_external    : 1
    <6d2>   DW_AT_declaration : 1
 <1><6d2>: Abbrev Number: 20 (DW_TAG_variable)
    <6d3>   DW_AT_name        : (indirect string, offset: 0x22f47): pulseCount
    <6d7>   DW_AT_decl_file   : 1
    <6d7>   DW_AT_decl_line   : 4
    <6d8>   DW_AT_decl_column : 19
    <6d8>   DW_AT_type        : <0xb8>
    <6dc>   DW_AT_external    : 1
    <6dc>   DW_AT_location    : 5 byte block: 3 84 0 0 20 	(DW_OP_addr: 20000084)
 <1><6e2>: Abbrev Number: 20 (DW_TAG_variable)
    <6e3>   DW_AT_name        : (indirect string, offset: 0x6f7f6): target_count
    <6e7>   DW_AT_decl_file   : 1
    <6e7>   DW_AT_decl_line   : 5
    <6e8>   DW_AT_decl_column : 19
    <6e8>   DW_AT_type        : <0xb8>
    <6ec>   DW_AT_external    : 1
    <6ec>   DW_AT_location    : 5 byte block: 3 88 0 0 20 	(DW_OP_addr: 20000088)
 <1><6f2>: Abbrev Number: 15 (DW_TAG_variable)
    <6f3>   DW_AT_name        : (indirect string, offset: 0x2add3): microstep_factor
    <6f7>   DW_AT_decl_file   : 1
    <6f7>   DW_AT_decl_line   : 6
    <6f8>   DW_AT_decl_column : 14
    <6f9>   DW_AT_type        : <0x703>
    <6fd>   DW_AT_location    : 5 byte block: 3 8c 0 0 20 	(DW_OP_addr: 2000008c)
 <1><703>: Abbrev Number: 6 (DW_TAG_base_type)
    <704>   DW_AT_byte_size   : 4
    <705>   DW_AT_encoding    : 4	(float)
    <706>   DW_AT_name        : (indirect string, offset: 0x88742): float
 <1><70a>: Abbrev Number: 15 (DW_TAG_variable)
    <70b>   DW_AT_name        : (indirect string, offset: 0x57eee): gen_complete
    <70f>   DW_AT_decl_file   : 1
    <70f>   DW_AT_decl_line   : 7
    <710>   DW_AT_decl_column : 16
    <711>   DW_AT_type        : <0x94>
    <715>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><71b>: Abbrev Number: 21 (DW_TAG_subprogram)
    <71c>   DW_AT_external    : 1
    <71c>   DW_AT_name        : (indirect string, offset: 0x4da0d): HAL_TIM_PWM_Stop_IT
    <720>   DW_AT_decl_file   : 8
    <720>   DW_AT_decl_line   : 1942
    <722>   DW_AT_decl_column : 19
    <722>   DW_AT_prototyped  : 1
    <722>   DW_AT_type        : <0x2fc>
    <726>   DW_AT_declaration : 1
    <726>   DW_AT_sibling     : <0x735>
 <2><72a>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <72b>   DW_AT_type        : <0x735>
 <2><72f>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <730>   DW_AT_type        : <0xac>
 <2><734>: Abbrev Number: 0
 <1><735>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <736>   DW_AT_byte_size   : 4
    <736>   DW_AT_type        : <0x6b9>
 <1><73a>: Abbrev Number: 21 (DW_TAG_subprogram)
    <73b>   DW_AT_external    : 1
    <73b>   DW_AT_name        : (indirect string, offset: 0x300d5): HAL_TIM_PWM_Start_IT
    <73f>   DW_AT_decl_file   : 8
    <73f>   DW_AT_decl_line   : 1941
    <741>   DW_AT_decl_column : 19
    <741>   DW_AT_prototyped  : 1
    <741>   DW_AT_type        : <0x2fc>
    <745>   DW_AT_declaration : 1
    <745>   DW_AT_sibling     : <0x754>
 <2><749>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <74a>   DW_AT_type        : <0x735>
 <2><74e>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <74f>   DW_AT_type        : <0xac>
 <2><753>: Abbrev Number: 0
 <1><754>: Abbrev Number: 28 (DW_TAG_subprogram)
    <755>   DW_AT_external    : 1
    <755>   DW_AT_name        : (indirect string, offset: 0x346d0): HAL_Delay
    <759>   DW_AT_decl_file   : 9
    <75a>   DW_AT_decl_line   : 296
    <75c>   DW_AT_decl_column : 6
    <75d>   DW_AT_prototyped  : 1
    <75d>   DW_AT_declaration : 1
    <75d>   DW_AT_sibling     : <0x767>
 <2><761>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <762>   DW_AT_type        : <0xac>
 <2><766>: Abbrev Number: 0
 <1><767>: Abbrev Number: 29 (DW_TAG_subprogram)
    <768>   DW_AT_external    : 1
    <768>   DW_AT_name        : (indirect string, offset: 0x174cc): HAL_GPIO_WritePin
    <76c>   DW_AT_decl_file   : 6
    <76d>   DW_AT_decl_line   : 234
    <76e>   DW_AT_decl_column : 6
    <76f>   DW_AT_prototyped  : 1
    <76f>   DW_AT_declaration : 1
    <76f>   DW_AT_sibling     : <0x783>
 <2><773>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <774>   DW_AT_type        : <0x783>
 <2><778>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <779>   DW_AT_type        : <0xa0>
 <2><77d>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <77e>   DW_AT_type        : <0x344>
 <2><782>: Abbrev Number: 0
 <1><783>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <784>   DW_AT_byte_size   : 4
    <784>   DW_AT_type        : <0x19d>
 <1><788>: Abbrev Number: 16 (DW_TAG_subprogram)
    <789>   DW_AT_external    : 1
    <789>   DW_AT_name        : (indirect string, offset: 0x671d3): HAL_TIM_PWM_PulseFinishedCallback
    <78d>   DW_AT_decl_file   : 1
    <78d>   DW_AT_decl_line   : 55
    <78e>   DW_AT_decl_column : 6
    <78e>   DW_AT_prototyped  : 1
    <78e>   DW_AT_low_pc      : 0x8000e3c
    <792>   DW_AT_high_pc     : 0x50
    <796>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <798>   DW_AT_call_all_tail_calls: 1
    <798>   DW_AT_sibling     : <0x7ab>
 <2><79c>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <79d>   DW_AT_name        : (indirect string, offset: 0x67933): htim
    <7a1>   DW_AT_decl_file   : 1
    <7a1>   DW_AT_decl_line   : 55
    <7a2>   DW_AT_decl_column : 59
    <7a3>   DW_AT_type        : <0x735>
    <7a7>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><7aa>: Abbrev Number: 0
 <1><7ab>: Abbrev Number: 16 (DW_TAG_subprogram)
    <7ac>   DW_AT_external    : 1
    <7ac>   DW_AT_name        : (indirect string, offset: 0x2fb22): configureSpeed
    <7b0>   DW_AT_decl_file   : 1
    <7b0>   DW_AT_decl_line   : 44
    <7b1>   DW_AT_decl_column : 6
    <7b1>   DW_AT_prototyped  : 1
    <7b1>   DW_AT_low_pc      : 0x8000dd0
    <7b5>   DW_AT_high_pc     : 0x6c
    <7b9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7bb>   DW_AT_call_all_tail_calls: 1
    <7bb>   DW_AT_sibling     : <0x7eb>
 <2><7bf>: Abbrev Number: 30 (DW_TAG_formal_parameter)
    <7c0>   DW_AT_name        : rps
    <7c4>   DW_AT_decl_file   : 1
    <7c5>   DW_AT_decl_line   : 44
    <7c6>   DW_AT_decl_column : 27
    <7c7>   DW_AT_type        : <0x703>
    <7cb>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><7ce>: Abbrev Number: 15 (DW_TAG_variable)
    <7cf>   DW_AT_name        : (indirect string, offset: 0x1c45): step_per_rev
    <7d3>   DW_AT_decl_file   : 1
    <7d3>   DW_AT_decl_line   : 45
    <7d4>   DW_AT_decl_column : 8
    <7d5>   DW_AT_type        : <0x703>
    <7d9>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><7dc>: Abbrev Number: 15 (DW_TAG_variable)
    <7dd>   DW_AT_name        : (indirect string, offset: 0x8dca3): freq
    <7e1>   DW_AT_decl_file   : 1
    <7e1>   DW_AT_decl_line   : 47
    <7e2>   DW_AT_decl_column : 8
    <7e3>   DW_AT_type        : <0x703>
    <7e7>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><7ea>: Abbrev Number: 0
 <1><7eb>: Abbrev Number: 16 (DW_TAG_subprogram)
    <7ec>   DW_AT_external    : 1
    <7ec>   DW_AT_name        : (indirect string, offset: 0x19662): generateStep
    <7f0>   DW_AT_decl_file   : 1
    <7f0>   DW_AT_decl_line   : 36
    <7f1>   DW_AT_decl_column : 6
    <7f1>   DW_AT_prototyped  : 1
    <7f1>   DW_AT_low_pc      : 0x8000d8c
    <7f5>   DW_AT_high_pc     : 0x44
    <7f9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7fb>   DW_AT_call_all_tail_calls: 1
    <7fb>   DW_AT_sibling     : <0x80e>
 <2><7ff>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <800>   DW_AT_name        : (indirect string, offset: 0x786bd): stepCount
    <804>   DW_AT_decl_file   : 1
    <804>   DW_AT_decl_line   : 36
    <805>   DW_AT_decl_column : 27
    <806>   DW_AT_type        : <0x94>
    <80a>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><80d>: Abbrev Number: 0
 <1><80e>: Abbrev Number: 16 (DW_TAG_subprogram)
    <80f>   DW_AT_external    : 1
    <80f>   DW_AT_name        : (indirect string, offset: 0x6cf82): setMicrostep
    <813>   DW_AT_decl_file   : 1
    <813>   DW_AT_decl_line   : 15
    <814>   DW_AT_decl_column : 6
    <814>   DW_AT_prototyped  : 1
    <814>   DW_AT_low_pc      : 0x8000ca0
    <818>   DW_AT_high_pc     : 0xec
    <81c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <81e>   DW_AT_call_all_tail_calls: 1
    <81e>   DW_AT_sibling     : <0x84d>
 <2><822>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <823>   DW_AT_name        : (indirect string, offset: 0x2a7d): mod2
    <827>   DW_AT_decl_file   : 1
    <827>   DW_AT_decl_line   : 15
    <828>   DW_AT_decl_column : 27
    <829>   DW_AT_type        : <0x94>
    <82d>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><830>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <831>   DW_AT_name        : (indirect string, offset: 0xe4e): mod1
    <835>   DW_AT_decl_file   : 1
    <835>   DW_AT_decl_line   : 15
    <836>   DW_AT_decl_column : 41
    <837>   DW_AT_type        : <0x94>
    <83b>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><83e>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <83f>   DW_AT_name        : (indirect string, offset: 0xe49): mod0
    <843>   DW_AT_decl_file   : 1
    <843>   DW_AT_decl_line   : 15
    <844>   DW_AT_decl_column : 55
    <845>   DW_AT_type        : <0x94>
    <849>   DW_AT_location    : 2 byte block: 91 75 	(DW_OP_fbreg: -11)
 <2><84c>: Abbrev Number: 0
 <1><84d>: Abbrev Number: 31 (DW_TAG_subprogram)
    <84e>   DW_AT_external    : 1
    <84e>   DW_AT_name        : (indirect string, offset: 0x361e3): stepperInit
    <852>   DW_AT_decl_file   : 1
    <853>   DW_AT_decl_line   : 9
    <854>   DW_AT_decl_column : 6
    <855>   DW_AT_prototyped  : 1
    <855>   DW_AT_low_pc      : 0x8000c6c
    <859>   DW_AT_high_pc     : 0x34
    <85d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <85f>   DW_AT_call_all_tail_calls: 1
 <1><85f>: Abbrev Number: 0
  Compilation Unit @ offset 0x860:
   Length:        0x835 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1f6
   Pointer Size:  4
 <0><86c>: Abbrev Number: 18 (DW_TAG_compile_unit)
    <86d>   DW_AT_producer    : (indirect string, offset: 0x1a4e9): GNU C11 12.3.1 20230626 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <871>   DW_AT_language    : 29	(C11)
    <872>   DW_AT_name        : (indirect string, offset: 0x8390c): ../Core/Src/encoder.c
    <876>   DW_AT_comp_dir    : (indirect string, offset: 0x67fd1): C:/Users/Orsted/STM32CubeIDE/workspace_1.17.0/WD17N_DRV/Debug
    <87a>   DW_AT_ranges      : 0x38
    <87e>   DW_AT_low_pc      : 0
    <882>   DW_AT_stmt_list   : 0x7dd
    <886>   DW_AT_macros      : 0x159c8
 <1><88a>: Abbrev Number: 6 (DW_TAG_base_type)
    <88b>   DW_AT_byte_size   : 1
    <88c>   DW_AT_encoding    : 6	(signed char)
    <88d>   DW_AT_name        : (indirect string, offset: 0x41e4c): signed char
 <1><891>: Abbrev Number: 4 (DW_TAG_typedef)
    <892>   DW_AT_name        : (indirect string, offset: 0x2681f): __uint8_t
    <896>   DW_AT_decl_file   : 2
    <897>   DW_AT_decl_line   : 43
    <898>   DW_AT_decl_column : 24
    <899>   DW_AT_type        : <0x89d>
 <1><89d>: Abbrev Number: 6 (DW_TAG_base_type)
    <89e>   DW_AT_byte_size   : 1
    <89f>   DW_AT_encoding    : 8	(unsigned char)
    <8a0>   DW_AT_name        : (indirect string, offset: 0x1aa92): unsigned char
 <1><8a4>: Abbrev Number: 6 (DW_TAG_base_type)
    <8a5>   DW_AT_byte_size   : 2
    <8a6>   DW_AT_encoding    : 5	(signed)
    <8a7>   DW_AT_name        : (indirect string, offset: 0x6224c): short int
 <1><8ab>: Abbrev Number: 4 (DW_TAG_typedef)
    <8ac>   DW_AT_name        : (indirect string, offset: 0x6bcdc): __uint16_t
    <8b0>   DW_AT_decl_file   : 2
    <8b1>   DW_AT_decl_line   : 57
    <8b2>   DW_AT_decl_column : 25
    <8b3>   DW_AT_type        : <0x8b7>
 <1><8b7>: Abbrev Number: 6 (DW_TAG_base_type)
    <8b8>   DW_AT_byte_size   : 2
    <8b9>   DW_AT_encoding    : 7	(unsigned)
    <8ba>   DW_AT_name        : (indirect string, offset: 0x2b15f): short unsigned int
 <1><8be>: Abbrev Number: 6 (DW_TAG_base_type)
    <8bf>   DW_AT_byte_size   : 4
    <8c0>   DW_AT_encoding    : 5	(signed)
    <8c1>   DW_AT_name        : (indirect string, offset: 0xb6ac): long int
 <1><8c5>: Abbrev Number: 4 (DW_TAG_typedef)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x53d35): __uint32_t
    <8ca>   DW_AT_decl_file   : 2
    <8cb>   DW_AT_decl_line   : 79
    <8cc>   DW_AT_decl_column : 25
    <8cd>   DW_AT_type        : <0x8d1>
 <1><8d1>: Abbrev Number: 6 (DW_TAG_base_type)
    <8d2>   DW_AT_byte_size   : 4
    <8d3>   DW_AT_encoding    : 7	(unsigned)
    <8d4>   DW_AT_name        : (indirect string, offset: 0x1ee4e): long unsigned int
 <1><8d8>: Abbrev Number: 6 (DW_TAG_base_type)
    <8d9>   DW_AT_byte_size   : 8
    <8da>   DW_AT_encoding    : 5	(signed)
    <8db>   DW_AT_name        : (indirect string, offset: 0x3c511): long long int
 <1><8df>: Abbrev Number: 6 (DW_TAG_base_type)
    <8e0>   DW_AT_byte_size   : 8
    <8e1>   DW_AT_encoding    : 7	(unsigned)
    <8e2>   DW_AT_name        : (indirect string, offset: 0x1b2ba): long long unsigned int
 <1><8e6>: Abbrev Number: 19 (DW_TAG_base_type)
    <8e7>   DW_AT_byte_size   : 4
    <8e8>   DW_AT_encoding    : 5	(signed)
    <8e9>   DW_AT_name        : int
 <1><8ed>: Abbrev Number: 6 (DW_TAG_base_type)
    <8ee>   DW_AT_byte_size   : 4
    <8ef>   DW_AT_encoding    : 7	(unsigned)
    <8f0>   DW_AT_name        : (indirect string, offset: 0xb06f): unsigned int
 <1><8f4>: Abbrev Number: 4 (DW_TAG_typedef)
    <8f5>   DW_AT_name        : (indirect string, offset: 0x26821): uint8_t
    <8f9>   DW_AT_decl_file   : 3
    <8fa>   DW_AT_decl_line   : 24
    <8fb>   DW_AT_decl_column : 19
    <8fc>   DW_AT_type        : <0x891>
 <1><900>: Abbrev Number: 4 (DW_TAG_typedef)
    <901>   DW_AT_name        : (indirect string, offset: 0x87ab5): uint16_t
    <905>   DW_AT_decl_file   : 3
    <906>   DW_AT_decl_line   : 36
    <907>   DW_AT_decl_column : 20
    <908>   DW_AT_type        : <0x8ab>
 <1><90c>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <90d>   DW_AT_type        : <0x900>
 <1><911>: Abbrev Number: 4 (DW_TAG_typedef)
    <912>   DW_AT_name        : (indirect string, offset: 0x87a95): uint32_t
    <916>   DW_AT_decl_file   : 3
    <917>   DW_AT_decl_line   : 48
    <918>   DW_AT_decl_column : 20
    <919>   DW_AT_type        : <0x8c5>
 <1><91d>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <91e>   DW_AT_type        : <0x911>
 <1><922>: Abbrev Number: 13 (DW_TAG_structure_type)
    <923>   DW_AT_byte_size   : 16
    <924>   DW_AT_decl_file   : 4
    <924>   DW_AT_decl_line   : 290
    <926>   DW_AT_decl_column : 9
    <926>   DW_AT_sibling     : <0x95b>
 <2><92a>: Abbrev Number: 5 (DW_TAG_member)
    <92b>   DW_AT_name        : CCR
    <92f>   DW_AT_decl_file   : 4
    <92f>   DW_AT_decl_line   : 292
    <931>   DW_AT_decl_column : 17
    <931>   DW_AT_type        : <0x91d>
    <935>   DW_AT_data_member_location: 0
 <2><936>: Abbrev Number: 8 (DW_TAG_member)
    <937>   DW_AT_name        : (indirect string, offset: 0x32b7e): CNDTR
    <93b>   DW_AT_decl_file   : 4
    <93b>   DW_AT_decl_line   : 293
    <93d>   DW_AT_decl_column : 17
    <93d>   DW_AT_type        : <0x91d>
    <941>   DW_AT_data_member_location: 4
 <2><942>: Abbrev Number: 8 (DW_TAG_member)
    <943>   DW_AT_name        : (indirect string, offset: 0x7e3dc): CPAR
    <947>   DW_AT_decl_file   : 4
    <947>   DW_AT_decl_line   : 294
    <949>   DW_AT_decl_column : 17
    <949>   DW_AT_type        : <0x91d>
    <94d>   DW_AT_data_member_location: 8
 <2><94e>: Abbrev Number: 8 (DW_TAG_member)
    <94f>   DW_AT_name        : (indirect string, offset: 0x48903): CMAR
    <953>   DW_AT_decl_file   : 4
    <953>   DW_AT_decl_line   : 295
    <955>   DW_AT_decl_column : 17
    <955>   DW_AT_type        : <0x91d>
    <959>   DW_AT_data_member_location: 12
 <2><95a>: Abbrev Number: 0
 <1><95b>: Abbrev Number: 14 (DW_TAG_typedef)
    <95c>   DW_AT_name        : (indirect string, offset: 0x6b4e2): DMA_Channel_TypeDef
    <960>   DW_AT_decl_file   : 4
    <960>   DW_AT_decl_line   : 296
    <962>   DW_AT_decl_column : 3
    <962>   DW_AT_type        : <0x922>
 <1><966>: Abbrev Number: 13 (DW_TAG_structure_type)
    <967>   DW_AT_byte_size   : 8
    <968>   DW_AT_decl_file   : 4
    <968>   DW_AT_decl_line   : 298
    <96a>   DW_AT_decl_column : 9
    <96a>   DW_AT_sibling     : <0x987>
 <2><96e>: Abbrev Number: 5 (DW_TAG_member)
    <96f>   DW_AT_name        : ISR
    <973>   DW_AT_decl_file   : 4
    <973>   DW_AT_decl_line   : 300
    <975>   DW_AT_decl_column : 17
    <975>   DW_AT_type        : <0x91d>
    <979>   DW_AT_data_member_location: 0
 <2><97a>: Abbrev Number: 8 (DW_TAG_member)
    <97b>   DW_AT_name        : (indirect string, offset: 0x5c606): IFCR
    <97f>   DW_AT_decl_file   : 4
    <97f>   DW_AT_decl_line   : 301
    <981>   DW_AT_decl_column : 17
    <981>   DW_AT_type        : <0x91d>
    <985>   DW_AT_data_member_location: 4
 <2><986>: Abbrev Number: 0
 <1><987>: Abbrev Number: 14 (DW_TAG_typedef)
    <988>   DW_AT_name        : (indirect string, offset: 0x2fc6e): DMA_TypeDef
    <98c>   DW_AT_decl_file   : 4
    <98c>   DW_AT_decl_line   : 302
    <98e>   DW_AT_decl_column : 3
    <98e>   DW_AT_type        : <0x966>
 <1><992>: Abbrev Number: 13 (DW_TAG_structure_type)
    <993>   DW_AT_byte_size   : 28
    <994>   DW_AT_decl_file   : 4
    <994>   DW_AT_decl_line   : 357
    <996>   DW_AT_decl_column : 9
    <996>   DW_AT_sibling     : <0x9ef>
 <2><99a>: Abbrev Number: 5 (DW_TAG_member)
    <99b>   DW_AT_name        : CRL
    <99f>   DW_AT_decl_file   : 4
    <99f>   DW_AT_decl_line   : 359
    <9a1>   DW_AT_decl_column : 17
    <9a1>   DW_AT_type        : <0x91d>
    <9a5>   DW_AT_data_member_location: 0
 <2><9a6>: Abbrev Number: 5 (DW_TAG_member)
    <9a7>   DW_AT_name        : CRH
    <9ab>   DW_AT_decl_file   : 4
    <9ab>   DW_AT_decl_line   : 360
    <9ad>   DW_AT_decl_column : 17
    <9ad>   DW_AT_type        : <0x91d>
    <9b1>   DW_AT_data_member_location: 4
 <2><9b2>: Abbrev Number: 5 (DW_TAG_member)
    <9b3>   DW_AT_name        : IDR
    <9b7>   DW_AT_decl_file   : 4
    <9b7>   DW_AT_decl_line   : 361
    <9b9>   DW_AT_decl_column : 17
    <9b9>   DW_AT_type        : <0x91d>
    <9bd>   DW_AT_data_member_location: 8
 <2><9be>: Abbrev Number: 5 (DW_TAG_member)
    <9bf>   DW_AT_name        : ODR
    <9c3>   DW_AT_decl_file   : 4
    <9c3>   DW_AT_decl_line   : 362
    <9c5>   DW_AT_decl_column : 17
    <9c5>   DW_AT_type        : <0x91d>
    <9c9>   DW_AT_data_member_location: 12
 <2><9ca>: Abbrev Number: 8 (DW_TAG_member)
    <9cb>   DW_AT_name        : (indirect string, offset: 0x1d5fb): BSRR
    <9cf>   DW_AT_decl_file   : 4
    <9cf>   DW_AT_decl_line   : 363
    <9d1>   DW_AT_decl_column : 17
    <9d1>   DW_AT_type        : <0x91d>
    <9d5>   DW_AT_data_member_location: 16
 <2><9d6>: Abbrev Number: 5 (DW_TAG_member)
    <9d7>   DW_AT_name        : BRR
    <9db>   DW_AT_decl_file   : 4
    <9db>   DW_AT_decl_line   : 364
    <9dd>   DW_AT_decl_column : 17
    <9dd>   DW_AT_type        : <0x91d>
    <9e1>   DW_AT_data_member_location: 20
 <2><9e2>: Abbrev Number: 8 (DW_TAG_member)
    <9e3>   DW_AT_name        : (indirect string, offset: 0x7102a): LCKR
    <9e7>   DW_AT_decl_file   : 4
    <9e7>   DW_AT_decl_line   : 365
    <9e9>   DW_AT_decl_column : 17
    <9e9>   DW_AT_type        : <0x91d>
    <9ed>   DW_AT_data_member_location: 24
 <2><9ee>: Abbrev Number: 0
 <1><9ef>: Abbrev Number: 14 (DW_TAG_typedef)
    <9f0>   DW_AT_name        : (indirect string, offset: 0x7ee4f): GPIO_TypeDef
    <9f4>   DW_AT_decl_file   : 4
    <9f4>   DW_AT_decl_line   : 366
    <9f6>   DW_AT_decl_column : 3
    <9f6>   DW_AT_type        : <0x992>
 <1><9fa>: Abbrev Number: 13 (DW_TAG_structure_type)
    <9fb>   DW_AT_byte_size   : 36
    <9fc>   DW_AT_decl_file   : 4
    <9fc>   DW_AT_decl_line   : 384
    <9fe>   DW_AT_decl_column : 9
    <9fe>   DW_AT_sibling     : <0xa6e>
 <2><a02>: Abbrev Number: 5 (DW_TAG_member)
    <a03>   DW_AT_name        : CR1
    <a07>   DW_AT_decl_file   : 4
    <a07>   DW_AT_decl_line   : 386
    <a09>   DW_AT_decl_column : 17
    <a09>   DW_AT_type        : <0x91d>
    <a0d>   DW_AT_data_member_location: 0
 <2><a0e>: Abbrev Number: 5 (DW_TAG_member)
    <a0f>   DW_AT_name        : CR2
    <a13>   DW_AT_decl_file   : 4
    <a13>   DW_AT_decl_line   : 387
    <a15>   DW_AT_decl_column : 17
    <a15>   DW_AT_type        : <0x91d>
    <a19>   DW_AT_data_member_location: 4
 <2><a1a>: Abbrev Number: 8 (DW_TAG_member)
    <a1b>   DW_AT_name        : (indirect string, offset: 0x83795): OAR1
    <a1f>   DW_AT_decl_file   : 4
    <a1f>   DW_AT_decl_line   : 388
    <a21>   DW_AT_decl_column : 17
    <a21>   DW_AT_type        : <0x91d>
    <a25>   DW_AT_data_member_location: 8
 <2><a26>: Abbrev Number: 8 (DW_TAG_member)
    <a27>   DW_AT_name        : (indirect string, offset: 0x8379a): OAR2
    <a2b>   DW_AT_decl_file   : 4
    <a2b>   DW_AT_decl_line   : 389
    <a2d>   DW_AT_decl_column : 17
    <a2d>   DW_AT_type        : <0x91d>
    <a31>   DW_AT_data_member_location: 12
 <2><a32>: Abbrev Number: 5 (DW_TAG_member)
    <a33>   DW_AT_name        : DR
    <a36>   DW_AT_decl_file   : 4
    <a36>   DW_AT_decl_line   : 390
    <a38>   DW_AT_decl_column : 17
    <a38>   DW_AT_type        : <0x91d>
    <a3c>   DW_AT_data_member_location: 16
 <2><a3d>: Abbrev Number: 5 (DW_TAG_member)
    <a3e>   DW_AT_name        : SR1
    <a42>   DW_AT_decl_file   : 4
    <a42>   DW_AT_decl_line   : 391
    <a44>   DW_AT_decl_column : 17
    <a44>   DW_AT_type        : <0x91d>
    <a48>   DW_AT_data_member_location: 20
 <2><a49>: Abbrev Number: 5 (DW_TAG_member)
    <a4a>   DW_AT_name        : SR2
    <a4e>   DW_AT_decl_file   : 4
    <a4e>   DW_AT_decl_line   : 392
    <a50>   DW_AT_decl_column : 17
    <a50>   DW_AT_type        : <0x91d>
    <a54>   DW_AT_data_member_location: 24
 <2><a55>: Abbrev Number: 5 (DW_TAG_member)
    <a56>   DW_AT_name        : CCR
    <a5a>   DW_AT_decl_file   : 4
    <a5a>   DW_AT_decl_line   : 393
    <a5c>   DW_AT_decl_column : 17
    <a5c>   DW_AT_type        : <0x91d>
    <a60>   DW_AT_data_member_location: 28
 <2><a61>: Abbrev Number: 8 (DW_TAG_member)
    <a62>   DW_AT_name        : (indirect string, offset: 0x8396a): TRISE
    <a66>   DW_AT_decl_file   : 4
    <a66>   DW_AT_decl_line   : 394
    <a68>   DW_AT_decl_column : 17
    <a68>   DW_AT_type        : <0x91d>
    <a6c>   DW_AT_data_member_location: 32
 <2><a6d>: Abbrev Number: 0
 <1><a6e>: Abbrev Number: 14 (DW_TAG_typedef)
    <a6f>   DW_AT_name        : (indirect string, offset: 0x83a1c): I2C_TypeDef
    <a73>   DW_AT_decl_file   : 4
    <a73>   DW_AT_decl_line   : 395
    <a75>   DW_AT_decl_column : 3
    <a75>   DW_AT_type        : <0x9fa>
 <1><a79>: Abbrev Number: 6 (DW_TAG_base_type)
    <a7a>   DW_AT_byte_size   : 8
    <a7b>   DW_AT_encoding    : 4	(float)
    <a7c>   DW_AT_name        : (indirect string, offset: 0x842ac): long double
 <1><a80>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <a81>   DW_AT_encoding    : 7	(unsigned)
    <a81>   DW_AT_byte_size   : 1
    <a81>   DW_AT_type        : <0x89d>
    <a85>   DW_AT_decl_file   : 5
    <a86>   DW_AT_decl_line   : 39
    <a87>   DW_AT_decl_column : 1
    <a87>   DW_AT_sibling     : <0xaa4>
 <2><a8b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a8c>   DW_AT_name        : (indirect string, offset: 0x2c758): HAL_OK
    <a90>   DW_AT_const_value : 0
 <2><a91>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a92>   DW_AT_name        : (indirect string, offset: 0x52648): HAL_ERROR
    <a96>   DW_AT_const_value : 1
 <2><a97>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a98>   DW_AT_name        : (indirect string, offset: 0x16e99): HAL_BUSY
    <a9c>   DW_AT_const_value : 2
 <2><a9d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a9e>   DW_AT_name        : (indirect string, offset: 0x26c9e): HAL_TIMEOUT
    <aa2>   DW_AT_const_value : 3
 <2><aa3>: Abbrev Number: 0
 <1><aa4>: Abbrev Number: 4 (DW_TAG_typedef)
    <aa5>   DW_AT_name        : (indirect string, offset: 0x1908): HAL_StatusTypeDef
    <aa9>   DW_AT_decl_file   : 5
    <aaa>   DW_AT_decl_line   : 44
    <aab>   DW_AT_decl_column : 3
    <aac>   DW_AT_type        : <0xa80>
 <1><ab0>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <ab1>   DW_AT_encoding    : 7	(unsigned)
    <ab1>   DW_AT_byte_size   : 1
    <ab1>   DW_AT_type        : <0x89d>
    <ab5>   DW_AT_decl_file   : 5
    <ab6>   DW_AT_decl_line   : 50
    <ab7>   DW_AT_decl_column : 1
    <ab7>   DW_AT_sibling     : <0xac8>
 <2><abb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <abc>   DW_AT_name        : (indirect string, offset: 0x615ef): HAL_UNLOCKED
    <ac0>   DW_AT_const_value : 0
 <2><ac1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ac2>   DW_AT_name        : (indirect string, offset: 0x82b3a): HAL_LOCKED
    <ac6>   DW_AT_const_value : 1
 <2><ac7>: Abbrev Number: 0
 <1><ac8>: Abbrev Number: 4 (DW_TAG_typedef)
    <ac9>   DW_AT_name        : (indirect string, offset: 0x4d6b6): HAL_LockTypeDef
    <acd>   DW_AT_decl_file   : 5
    <ace>   DW_AT_decl_line   : 53
    <acf>   DW_AT_decl_column : 3
    <ad0>   DW_AT_type        : <0xab0>
 <1><ad4>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <ad5>   DW_AT_encoding    : 7	(unsigned)
    <ad5>   DW_AT_byte_size   : 1
    <ad5>   DW_AT_type        : <0x89d>
    <ad9>   DW_AT_decl_file   : 6
    <ada>   DW_AT_decl_line   : 65
    <adb>   DW_AT_decl_column : 1
    <adb>   DW_AT_sibling     : <0xaec>
 <2><adf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ae0>   DW_AT_name        : (indirect string, offset: 0x1afee): GPIO_PIN_RESET
    <ae4>   DW_AT_const_value : 0
 <2><ae5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ae6>   DW_AT_name        : (indirect string, offset: 0x17111): GPIO_PIN_SET
    <aea>   DW_AT_const_value : 1
 <2><aeb>: Abbrev Number: 0
 <1><aec>: Abbrev Number: 4 (DW_TAG_typedef)
    <aed>   DW_AT_name        : (indirect string, offset: 0x80580): GPIO_PinState
    <af1>   DW_AT_decl_file   : 6
    <af2>   DW_AT_decl_line   : 68
    <af3>   DW_AT_decl_column : 3
    <af4>   DW_AT_type        : <0xad4>
 <1><af8>: Abbrev Number: 16 (DW_TAG_structure_type)
    <af9>   DW_AT_byte_size   : 28
    <afa>   DW_AT_decl_file   : 7
    <afb>   DW_AT_decl_line   : 47
    <afc>   DW_AT_decl_column : 9
    <afc>   DW_AT_sibling     : <0xb5c>
 <2><b00>: Abbrev Number: 1 (DW_TAG_member)
    <b01>   DW_AT_name        : (indirect string, offset: 0x8d808): Direction
    <b05>   DW_AT_decl_file   : 7
    <b06>   DW_AT_decl_line   : 49
    <b07>   DW_AT_decl_column : 12
    <b08>   DW_AT_type        : <0x911>
    <b0c>   DW_AT_data_member_location: 0
 <2><b0d>: Abbrev Number: 1 (DW_TAG_member)
    <b0e>   DW_AT_name        : (indirect string, offset: 0x8e74): PeriphInc
    <b12>   DW_AT_decl_file   : 7
    <b13>   DW_AT_decl_line   : 53
    <b14>   DW_AT_decl_column : 12
    <b15>   DW_AT_type        : <0x911>
    <b19>   DW_AT_data_member_location: 4
 <2><b1a>: Abbrev Number: 1 (DW_TAG_member)
    <b1b>   DW_AT_name        : (indirect string, offset: 0x14946): MemInc
    <b1f>   DW_AT_decl_file   : 7
    <b20>   DW_AT_decl_line   : 56
    <b21>   DW_AT_decl_column : 12
    <b22>   DW_AT_type        : <0x911>
    <b26>   DW_AT_data_member_location: 8
 <2><b27>: Abbrev Number: 1 (DW_TAG_member)
    <b28>   DW_AT_name        : (indirect string, offset: 0x41752): PeriphDataAlignment
    <b2c>   DW_AT_decl_file   : 7
    <b2d>   DW_AT_decl_line   : 59
    <b2e>   DW_AT_decl_column : 12
    <b2f>   DW_AT_type        : <0x911>
    <b33>   DW_AT_data_member_location: 12
 <2><b34>: Abbrev Number: 1 (DW_TAG_member)
    <b35>   DW_AT_name        : (indirect string, offset: 0x76a2d): MemDataAlignment
    <b39>   DW_AT_decl_file   : 7
    <b3a>   DW_AT_decl_line   : 62
    <b3b>   DW_AT_decl_column : 12
    <b3c>   DW_AT_type        : <0x911>
    <b40>   DW_AT_data_member_location: 16
 <2><b41>: Abbrev Number: 1 (DW_TAG_member)
    <b42>   DW_AT_name        : (indirect string, offset: 0x8a929): Mode
    <b46>   DW_AT_decl_file   : 7
    <b47>   DW_AT_decl_line   : 65
    <b48>   DW_AT_decl_column : 12
    <b49>   DW_AT_type        : <0x911>
    <b4d>   DW_AT_data_member_location: 20
 <2><b4e>: Abbrev Number: 1 (DW_TAG_member)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x8cc03): Priority
    <b53>   DW_AT_decl_file   : 7
    <b54>   DW_AT_decl_line   : 70
    <b55>   DW_AT_decl_column : 12
    <b56>   DW_AT_type        : <0x911>
    <b5a>   DW_AT_data_member_location: 24
 <2><b5b>: Abbrev Number: 0
 <1><b5c>: Abbrev Number: 4 (DW_TAG_typedef)
    <b5d>   DW_AT_name        : (indirect string, offset: 0x2329b): DMA_InitTypeDef
    <b61>   DW_AT_decl_file   : 7
    <b62>   DW_AT_decl_line   : 72
    <b63>   DW_AT_decl_column : 3
    <b64>   DW_AT_type        : <0xaf8>
 <1><b68>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <b69>   DW_AT_encoding    : 7	(unsigned)
    <b69>   DW_AT_byte_size   : 1
    <b69>   DW_AT_type        : <0x89d>
    <b6d>   DW_AT_decl_file   : 7
    <b6e>   DW_AT_decl_line   : 78
    <b6f>   DW_AT_decl_column : 1
    <b6f>   DW_AT_sibling     : <0xb8c>
 <2><b73>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b74>   DW_AT_name        : (indirect string, offset: 0x624de): HAL_DMA_STATE_RESET
    <b78>   DW_AT_const_value : 0
 <2><b79>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b7a>   DW_AT_name        : (indirect string, offset: 0x23f8b): HAL_DMA_STATE_READY
    <b7e>   DW_AT_const_value : 1
 <2><b7f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b80>   DW_AT_name        : (indirect string, offset: 0x5b77e): HAL_DMA_STATE_BUSY
    <b84>   DW_AT_const_value : 2
 <2><b85>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b86>   DW_AT_name        : (indirect string, offset: 0x8085f): HAL_DMA_STATE_TIMEOUT
    <b8a>   DW_AT_const_value : 3
 <2><b8b>: Abbrev Number: 0
 <1><b8c>: Abbrev Number: 4 (DW_TAG_typedef)
    <b8d>   DW_AT_name        : (indirect string, offset: 0x57ed9): HAL_DMA_StateTypeDef
    <b91>   DW_AT_decl_file   : 7
    <b92>   DW_AT_decl_line   : 83
    <b93>   DW_AT_decl_column : 2
    <b94>   DW_AT_type        : <0xb68>
 <1><b98>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <b99>   DW_AT_type        : <0xb8c>
 <1><b9d>: Abbrev Number: 20 (DW_TAG_structure_type)
    <b9e>   DW_AT_name        : (indirect string, offset: 0x7041e): __DMA_HandleTypeDef
    <ba2>   DW_AT_byte_size   : 68
    <ba3>   DW_AT_decl_file   : 7
    <ba4>   DW_AT_decl_line   : 110
    <ba5>   DW_AT_decl_column : 16
    <ba6>   DW_AT_sibling     : <0xc47>
 <2><baa>: Abbrev Number: 1 (DW_TAG_member)
    <bab>   DW_AT_name        : (indirect string, offset: 0x331c9): Instance
    <baf>   DW_AT_decl_file   : 7
    <bb0>   DW_AT_decl_line   : 112
    <bb1>   DW_AT_decl_column : 31
    <bb2>   DW_AT_type        : <0xc47>
    <bb6>   DW_AT_data_member_location: 0
 <2><bb7>: Abbrev Number: 1 (DW_TAG_member)
    <bb8>   DW_AT_name        : (indirect string, offset: 0x8ba18): Init
    <bbc>   DW_AT_decl_file   : 7
    <bbd>   DW_AT_decl_line   : 114
    <bbe>   DW_AT_decl_column : 30
    <bbf>   DW_AT_type        : <0xb5c>
    <bc3>   DW_AT_data_member_location: 4
 <2><bc4>: Abbrev Number: 1 (DW_TAG_member)
    <bc5>   DW_AT_name        : (indirect string, offset: 0x5e086): Lock
    <bc9>   DW_AT_decl_file   : 7
    <bca>   DW_AT_decl_line   : 116
    <bcb>   DW_AT_decl_column : 30
    <bcc>   DW_AT_type        : <0xac8>
    <bd0>   DW_AT_data_member_location: 32
 <2><bd1>: Abbrev Number: 1 (DW_TAG_member)
    <bd2>   DW_AT_name        : (indirect string, offset: 0x8b3ae): State
    <bd6>   DW_AT_decl_file   : 7
    <bd7>   DW_AT_decl_line   : 118
    <bd8>   DW_AT_decl_column : 30
    <bd9>   DW_AT_type        : <0xb98>
    <bdd>   DW_AT_data_member_location: 33
 <2><bde>: Abbrev Number: 1 (DW_TAG_member)
    <bdf>   DW_AT_name        : (indirect string, offset: 0x7c688): Parent
    <be3>   DW_AT_decl_file   : 7
    <be4>   DW_AT_decl_line   : 120
    <be5>   DW_AT_decl_column : 31
    <be6>   DW_AT_type        : <0xc4c>
    <bea>   DW_AT_data_member_location: 36
 <2><beb>: Abbrev Number: 1 (DW_TAG_member)
    <bec>   DW_AT_name        : (indirect string, offset: 0x82187): XferCpltCallback
    <bf0>   DW_AT_decl_file   : 7
    <bf1>   DW_AT_decl_line   : 122
    <bf2>   DW_AT_decl_column : 33
    <bf3>   DW_AT_type        : <0xc5e>
    <bf7>   DW_AT_data_member_location: 40
 <2><bf8>: Abbrev Number: 1 (DW_TAG_member)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x666ec): XferHalfCpltCallback
    <bfd>   DW_AT_decl_file   : 7
    <bfe>   DW_AT_decl_line   : 124
    <bff>   DW_AT_decl_column : 33
    <c00>   DW_AT_type        : <0xc5e>
    <c04>   DW_AT_data_member_location: 44
 <2><c05>: Abbrev Number: 1 (DW_TAG_member)
    <c06>   DW_AT_name        : (indirect string, offset: 0x12d1b): XferErrorCallback
    <c0a>   DW_AT_decl_file   : 7
    <c0b>   DW_AT_decl_line   : 126
    <c0c>   DW_AT_decl_column : 33
    <c0d>   DW_AT_type        : <0xc5e>
    <c11>   DW_AT_data_member_location: 48
 <2><c12>: Abbrev Number: 1 (DW_TAG_member)
    <c13>   DW_AT_name        : (indirect string, offset: 0x7a2e9): XferAbortCallback
    <c17>   DW_AT_decl_file   : 7
    <c18>   DW_AT_decl_line   : 128
    <c19>   DW_AT_decl_column : 33
    <c1a>   DW_AT_type        : <0xc5e>
    <c1e>   DW_AT_data_member_location: 52
 <2><c1f>: Abbrev Number: 1 (DW_TAG_member)
    <c20>   DW_AT_name        : (indirect string, offset: 0x7fbdd): ErrorCode
    <c24>   DW_AT_decl_file   : 7
    <c25>   DW_AT_decl_line   : 130
    <c26>   DW_AT_decl_column : 30
    <c27>   DW_AT_type        : <0x91d>
    <c2b>   DW_AT_data_member_location: 56
 <2><c2c>: Abbrev Number: 1 (DW_TAG_member)
    <c2d>   DW_AT_name        : (indirect string, offset: 0x38530): DmaBaseAddress
    <c31>   DW_AT_decl_file   : 7
    <c32>   DW_AT_decl_line   : 132
    <c33>   DW_AT_decl_column : 31
    <c34>   DW_AT_type        : <0xc63>
    <c38>   DW_AT_data_member_location: 60
 <2><c39>: Abbrev Number: 1 (DW_TAG_member)
    <c3a>   DW_AT_name        : (indirect string, offset: 0x1b07f): ChannelIndex
    <c3e>   DW_AT_decl_file   : 7
    <c3f>   DW_AT_decl_line   : 134
    <c40>   DW_AT_decl_column : 30
    <c41>   DW_AT_type        : <0x911>
    <c45>   DW_AT_data_member_location: 64
 <2><c46>: Abbrev Number: 0
 <1><c47>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <c48>   DW_AT_byte_size   : 4
    <c48>   DW_AT_type        : <0x95b>
 <1><c4c>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <c4d>   DW_AT_byte_size   : 4
 <1><c4e>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <c4f>   DW_AT_prototyped  : 1
    <c4f>   DW_AT_sibling     : <0xc59>
 <2><c53>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <c54>   DW_AT_type        : <0xc59>
 <2><c58>: Abbrev Number: 0
 <1><c59>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <c5a>   DW_AT_byte_size   : 4
    <c5a>   DW_AT_type        : <0xb9d>
 <1><c5e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <c5f>   DW_AT_byte_size   : 4
    <c5f>   DW_AT_type        : <0xc4e>
 <1><c63>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <c64>   DW_AT_byte_size   : 4
    <c64>   DW_AT_type        : <0x987>
 <1><c68>: Abbrev Number: 4 (DW_TAG_typedef)
    <c69>   DW_AT_name        : (indirect string, offset: 0x70420): DMA_HandleTypeDef
    <c6d>   DW_AT_decl_file   : 7
    <c6e>   DW_AT_decl_line   : 136
    <c6f>   DW_AT_decl_column : 3
    <c70>   DW_AT_type        : <0xb9d>
 <1><c74>: Abbrev Number: 16 (DW_TAG_structure_type)
    <c75>   DW_AT_byte_size   : 32
    <c76>   DW_AT_decl_file   : 8
    <c77>   DW_AT_decl_line   : 47
    <c78>   DW_AT_decl_column : 9
    <c78>   DW_AT_sibling     : <0xce5>
 <2><c7c>: Abbrev Number: 1 (DW_TAG_member)
    <c7d>   DW_AT_name        : (indirect string, offset: 0x83aaf): ClockSpeed
    <c81>   DW_AT_decl_file   : 8
    <c82>   DW_AT_decl_line   : 49
    <c83>   DW_AT_decl_column : 12
    <c84>   DW_AT_type        : <0x911>
    <c88>   DW_AT_data_member_location: 0
 <2><c89>: Abbrev Number: 1 (DW_TAG_member)
    <c8a>   DW_AT_name        : (indirect string, offset: 0x83976): DutyCycle
    <c8e>   DW_AT_decl_file   : 8
    <c8f>   DW_AT_decl_line   : 52
    <c90>   DW_AT_decl_column : 12
    <c91>   DW_AT_type        : <0x911>
    <c95>   DW_AT_data_member_location: 4
 <2><c96>: Abbrev Number: 1 (DW_TAG_member)
    <c97>   DW_AT_name        : (indirect string, offset: 0x8381b): OwnAddress1
    <c9b>   DW_AT_decl_file   : 8
    <c9c>   DW_AT_decl_line   : 55
    <c9d>   DW_AT_decl_column : 12
    <c9e>   DW_AT_type        : <0x911>
    <ca2>   DW_AT_data_member_location: 8
 <2><ca3>: Abbrev Number: 1 (DW_TAG_member)
    <ca4>   DW_AT_name        : (indirect string, offset: 0x838d4): AddressingMode
    <ca8>   DW_AT_decl_file   : 8
    <ca9>   DW_AT_decl_line   : 58
    <caa>   DW_AT_decl_column : 12
    <cab>   DW_AT_type        : <0x911>
    <caf>   DW_AT_data_member_location: 12
 <2><cb0>: Abbrev Number: 1 (DW_TAG_member)
    <cb1>   DW_AT_name        : (indirect string, offset: 0x839fd): DualAddressMode
    <cb5>   DW_AT_decl_file   : 8
    <cb6>   DW_AT_decl_line   : 61
    <cb7>   DW_AT_decl_column : 12
    <cb8>   DW_AT_type        : <0x911>
    <cbc>   DW_AT_data_member_location: 16
 <2><cbd>: Abbrev Number: 1 (DW_TAG_member)
    <cbe>   DW_AT_name        : (indirect string, offset: 0x83827): OwnAddress2
    <cc2>   DW_AT_decl_file   : 8
    <cc3>   DW_AT_decl_line   : 64
    <cc4>   DW_AT_decl_column : 12
    <cc5>   DW_AT_type        : <0x911>
    <cc9>   DW_AT_data_member_location: 20
 <2><cca>: Abbrev Number: 1 (DW_TAG_member)
    <ccb>   DW_AT_name        : (indirect string, offset: 0x836f7): GeneralCallMode
    <ccf>   DW_AT_decl_file   : 8
    <cd0>   DW_AT_decl_line   : 67
    <cd1>   DW_AT_decl_column : 12
    <cd2>   DW_AT_type        : <0x911>
    <cd6>   DW_AT_data_member_location: 24
 <2><cd7>: Abbrev Number: 1 (DW_TAG_member)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x837a6): NoStretchMode
    <cdc>   DW_AT_decl_file   : 8
    <cdd>   DW_AT_decl_line   : 70
    <cde>   DW_AT_decl_column : 12
    <cdf>   DW_AT_type        : <0x911>
    <ce3>   DW_AT_data_member_location: 28
 <2><ce4>: Abbrev Number: 0
 <1><ce5>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce6>   DW_AT_name        : (indirect string, offset: 0x837d2): I2C_InitTypeDef
    <cea>   DW_AT_decl_file   : 8
    <ceb>   DW_AT_decl_line   : 73
    <cec>   DW_AT_decl_column : 3
    <ced>   DW_AT_type        : <0xc74>
 <1><cf1>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <cf2>   DW_AT_encoding    : 7	(unsigned)
    <cf2>   DW_AT_byte_size   : 1
    <cf2>   DW_AT_type        : <0x89d>
    <cf6>   DW_AT_decl_file   : 8
    <cf7>   DW_AT_decl_line   : 107
    <cf8>   DW_AT_decl_column : 1
    <cf8>   DW_AT_sibling     : <0xd3f>
 <2><cfc>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cfd>   DW_AT_name        : (indirect string, offset: 0x8367f): HAL_I2C_STATE_RESET
    <d01>   DW_AT_const_value : 0
 <2><d02>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d03>   DW_AT_name        : (indirect string, offset: 0x837e2): HAL_I2C_STATE_READY
    <d07>   DW_AT_const_value : 32
 <2><d08>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d09>   DW_AT_name        : (indirect string, offset: 0x836d2): HAL_I2C_STATE_BUSY
    <d0d>   DW_AT_const_value : 36
 <2><d0e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x5eeff): HAL_I2C_STATE_BUSY_TX
    <d13>   DW_AT_const_value : 33
 <2><d14>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d15>   DW_AT_name        : (indirect string, offset: 0x2e0c2): HAL_I2C_STATE_BUSY_RX
    <d19>   DW_AT_const_value : 34
 <2><d1a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d1b>   DW_AT_name        : (indirect string, offset: 0x8385a): HAL_I2C_STATE_LISTEN
    <d1f>   DW_AT_const_value : 40
 <2><d20>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d21>   DW_AT_name        : (indirect string, offset: 0x83766): HAL_I2C_STATE_BUSY_TX_LISTEN
    <d25>   DW_AT_const_value : 41
 <2><d26>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d27>   DW_AT_name        : (indirect string, offset: 0x839cc): HAL_I2C_STATE_BUSY_RX_LISTEN
    <d2b>   DW_AT_const_value : 42
 <2><d2c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d2d>   DW_AT_name        : (indirect string, offset: 0x83846): HAL_I2C_STATE_ABORT
    <d31>   DW_AT_const_value : 96
 <2><d32>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d33>   DW_AT_name        : (indirect string, offset: 0x83a3e): HAL_I2C_STATE_TIMEOUT
    <d37>   DW_AT_const_value : 160
 <2><d38>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d39>   DW_AT_name        : (indirect string, offset: 0x83a6b): HAL_I2C_STATE_ERROR
    <d3d>   DW_AT_const_value : 224
 <2><d3e>: Abbrev Number: 0
 <1><d3f>: Abbrev Number: 4 (DW_TAG_typedef)
    <d40>   DW_AT_name        : (indirect string, offset: 0x83707): HAL_I2C_StateTypeDef
    <d44>   DW_AT_decl_file   : 8
    <d45>   DW_AT_decl_line   : 122
    <d46>   DW_AT_decl_column : 3
    <d47>   DW_AT_type        : <0xcf1>
 <1><d4b>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <d4c>   DW_AT_type        : <0xd3f>
 <1><d50>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <d51>   DW_AT_encoding    : 7	(unsigned)
    <d51>   DW_AT_byte_size   : 1
    <d51>   DW_AT_type        : <0x89d>
    <d55>   DW_AT_decl_file   : 8
    <d56>   DW_AT_decl_line   : 147
    <d57>   DW_AT_decl_column : 1
    <d57>   DW_AT_sibling     : <0xd74>
 <2><d5b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d5c>   DW_AT_name        : (indirect string, offset: 0x83783): HAL_I2C_MODE_NONE
    <d60>   DW_AT_const_value : 0
 <2><d61>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d62>   DW_AT_name        : (indirect string, offset: 0x83665): HAL_I2C_MODE_MASTER
    <d66>   DW_AT_const_value : 16
 <2><d67>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d68>   DW_AT_name        : (indirect string, offset: 0x83a85): HAL_I2C_MODE_SLAVE
    <d6c>   DW_AT_const_value : 32
 <2><d6d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d6e>   DW_AT_name        : (indirect string, offset: 0x837b4): HAL_I2C_MODE_MEM
    <d72>   DW_AT_const_value : 64
 <2><d73>: Abbrev Number: 0
 <1><d74>: Abbrev Number: 4 (DW_TAG_typedef)
    <d75>   DW_AT_name        : (indirect string, offset: 0x83956): HAL_I2C_ModeTypeDef
    <d79>   DW_AT_decl_file   : 8
    <d7a>   DW_AT_decl_line   : 153
    <d7b>   DW_AT_decl_column : 3
    <d7c>   DW_AT_type        : <0xd50>
 <1><d80>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <d81>   DW_AT_type        : <0xd74>
 <1><d85>: Abbrev Number: 16 (DW_TAG_structure_type)
    <d86>   DW_AT_byte_size   : 84
    <d87>   DW_AT_decl_file   : 8
    <d88>   DW_AT_decl_line   : 187
    <d89>   DW_AT_decl_column : 9
    <d89>   DW_AT_sibling     : <0xe6b>
 <2><d8d>: Abbrev Number: 1 (DW_TAG_member)
    <d8e>   DW_AT_name        : (indirect string, offset: 0x331c9): Instance
    <d92>   DW_AT_decl_file   : 8
    <d93>   DW_AT_decl_line   : 190
    <d94>   DW_AT_decl_column : 31
    <d95>   DW_AT_type        : <0xe6b>
    <d99>   DW_AT_data_member_location: 0
 <2><d9a>: Abbrev Number: 1 (DW_TAG_member)
    <d9b>   DW_AT_name        : (indirect string, offset: 0x8ba18): Init
    <d9f>   DW_AT_decl_file   : 8
    <da0>   DW_AT_decl_line   : 192
    <da1>   DW_AT_decl_column : 30
    <da2>   DW_AT_type        : <0xce5>
    <da6>   DW_AT_data_member_location: 4
 <2><da7>: Abbrev Number: 1 (DW_TAG_member)
    <da8>   DW_AT_name        : (indirect string, offset: 0x836c9): pBuffPtr
    <dac>   DW_AT_decl_file   : 8
    <dad>   DW_AT_decl_line   : 194
    <dae>   DW_AT_decl_column : 31
    <daf>   DW_AT_type        : <0xe70>
    <db3>   DW_AT_data_member_location: 36
 <2><db4>: Abbrev Number: 1 (DW_TAG_member)
    <db5>   DW_AT_name        : (indirect string, offset: 0x83812): XferSize
    <db9>   DW_AT_decl_file   : 8
    <dba>   DW_AT_decl_line   : 196
    <dbb>   DW_AT_decl_column : 30
    <dbc>   DW_AT_type        : <0x900>
    <dc0>   DW_AT_data_member_location: 40
 <2><dc1>: Abbrev Number: 1 (DW_TAG_member)
    <dc2>   DW_AT_name        : (indirect string, offset: 0x839e9): XferCount
    <dc6>   DW_AT_decl_file   : 8
    <dc7>   DW_AT_decl_line   : 198
    <dc8>   DW_AT_decl_column : 30
    <dc9>   DW_AT_type        : <0x90c>
    <dcd>   DW_AT_data_member_location: 42
 <2><dce>: Abbrev Number: 1 (DW_TAG_member)
    <dcf>   DW_AT_name        : (indirect string, offset: 0x8d1c9): XferOptions
    <dd3>   DW_AT_decl_file   : 8
    <dd4>   DW_AT_decl_line   : 200
    <dd5>   DW_AT_decl_column : 30
    <dd6>   DW_AT_type        : <0x91d>
    <dda>   DW_AT_data_member_location: 44
 <2><ddb>: Abbrev Number: 1 (DW_TAG_member)
    <ddc>   DW_AT_name        : (indirect string, offset: 0x838f3): PreviousState
    <de0>   DW_AT_decl_file   : 8
    <de1>   DW_AT_decl_line   : 202
    <de2>   DW_AT_decl_column : 30
    <de3>   DW_AT_type        : <0x91d>
    <de7>   DW_AT_data_member_location: 48
 <2><de8>: Abbrev Number: 1 (DW_TAG_member)
    <de9>   DW_AT_name        : (indirect string, offset: 0x83ac1): hdmatx
    <ded>   DW_AT_decl_file   : 8
    <dee>   DW_AT_decl_line   : 205
    <def>   DW_AT_decl_column : 31
    <df0>   DW_AT_type        : <0xe75>
    <df4>   DW_AT_data_member_location: 52
 <2><df5>: Abbrev Number: 1 (DW_TAG_member)
    <df6>   DW_AT_name        : (indirect string, offset: 0x83aba): hdmarx
    <dfa>   DW_AT_decl_file   : 8
    <dfb>   DW_AT_decl_line   : 207
    <dfc>   DW_AT_decl_column : 31
    <dfd>   DW_AT_type        : <0xe75>
    <e01>   DW_AT_data_member_location: 56
 <2><e02>: Abbrev Number: 1 (DW_TAG_member)
    <e03>   DW_AT_name        : (indirect string, offset: 0x5e086): Lock
    <e07>   DW_AT_decl_file   : 8
    <e08>   DW_AT_decl_line   : 209
    <e09>   DW_AT_decl_column : 30
    <e0a>   DW_AT_type        : <0xac8>
    <e0e>   DW_AT_data_member_location: 60
 <2><e0f>: Abbrev Number: 1 (DW_TAG_member)
    <e10>   DW_AT_name        : (indirect string, offset: 0x8b3ae): State
    <e14>   DW_AT_decl_file   : 8
    <e15>   DW_AT_decl_line   : 211
    <e16>   DW_AT_decl_column : 30
    <e17>   DW_AT_type        : <0xd4b>
    <e1b>   DW_AT_data_member_location: 61
 <2><e1c>: Abbrev Number: 1 (DW_TAG_member)
    <e1d>   DW_AT_name        : (indirect string, offset: 0x8a929): Mode
    <e21>   DW_AT_decl_file   : 8
    <e22>   DW_AT_decl_line   : 213
    <e23>   DW_AT_decl_column : 30
    <e24>   DW_AT_type        : <0xd80>
    <e28>   DW_AT_data_member_location: 62
 <2><e29>: Abbrev Number: 1 (DW_TAG_member)
    <e2a>   DW_AT_name        : (indirect string, offset: 0x7fbdd): ErrorCode
    <e2e>   DW_AT_decl_file   : 8
    <e2f>   DW_AT_decl_line   : 215
    <e30>   DW_AT_decl_column : 30
    <e31>   DW_AT_type        : <0x91d>
    <e35>   DW_AT_data_member_location: 64
 <2><e36>: Abbrev Number: 1 (DW_TAG_member)
    <e37>   DW_AT_name        : (indirect string, offset: 0x83997): Devaddress
    <e3b>   DW_AT_decl_file   : 8
    <e3c>   DW_AT_decl_line   : 217
    <e3d>   DW_AT_decl_column : 30
    <e3e>   DW_AT_type        : <0x91d>
    <e42>   DW_AT_data_member_location: 68
 <2><e43>: Abbrev Number: 1 (DW_TAG_member)
    <e44>   DW_AT_name        : (indirect string, offset: 0x8398c): Memaddress
    <e48>   DW_AT_decl_file   : 8
    <e49>   DW_AT_decl_line   : 219
    <e4a>   DW_AT_decl_column : 30
    <e4b>   DW_AT_type        : <0x91d>
    <e4f>   DW_AT_data_member_location: 72
 <2><e50>: Abbrev Number: 1 (DW_TAG_member)
    <e51>   DW_AT_name        : (indirect string, offset: 0x83940): MemaddSize
    <e55>   DW_AT_decl_file   : 8
    <e56>   DW_AT_decl_line   : 221
    <e57>   DW_AT_decl_column : 30
    <e58>   DW_AT_type        : <0x91d>
    <e5c>   DW_AT_data_member_location: 76
 <2><e5d>: Abbrev Number: 1 (DW_TAG_member)
    <e5e>   DW_AT_name        : (indirect string, offset: 0x8394b): EventCount
    <e62>   DW_AT_decl_file   : 8
    <e63>   DW_AT_decl_line   : 223
    <e64>   DW_AT_decl_column : 30
    <e65>   DW_AT_type        : <0x91d>
    <e69>   DW_AT_data_member_location: 80
 <2><e6a>: Abbrev Number: 0
 <1><e6b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e6c>   DW_AT_byte_size   : 4
    <e6c>   DW_AT_type        : <0xa6e>
 <1><e70>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e71>   DW_AT_byte_size   : 4
    <e71>   DW_AT_type        : <0x8f4>
 <1><e75>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e76>   DW_AT_byte_size   : 4
    <e76>   DW_AT_type        : <0xc68>
 <1><e7a>: Abbrev Number: 4 (DW_TAG_typedef)
    <e7b>   DW_AT_name        : (indirect string, offset: 0x83800): I2C_HandleTypeDef
    <e7f>   DW_AT_decl_file   : 8
    <e80>   DW_AT_decl_line   : 243
    <e81>   DW_AT_decl_column : 3
    <e82>   DW_AT_type        : <0xd85>
 <1><e86>: Abbrev Number: 23 (DW_TAG_variable)
    <e87>   DW_AT_name        : (indirect string, offset: 0x83679): hi2c1
    <e8b>   DW_AT_decl_file   : 1
    <e8c>   DW_AT_decl_line   : 8
    <e8d>   DW_AT_decl_column : 26
    <e8e>   DW_AT_type        : <0xe7a>
    <e92>   DW_AT_external    : 1
    <e92>   DW_AT_declaration : 1
 <1><e92>: Abbrev Number: 24 (DW_TAG_subprogram)
    <e93>   DW_AT_external    : 1
    <e93>   DW_AT_name        : (indirect string, offset: 0x174cc): HAL_GPIO_WritePin
    <e97>   DW_AT_decl_file   : 6
    <e98>   DW_AT_decl_line   : 234
    <e99>   DW_AT_decl_column : 6
    <e9a>   DW_AT_prototyped  : 1
    <e9a>   DW_AT_declaration : 1
    <e9a>   DW_AT_sibling     : <0xeae>
 <2><e9e>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e9f>   DW_AT_type        : <0xeae>
 <2><ea3>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <ea4>   DW_AT_type        : <0x900>
 <2><ea8>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <ea9>   DW_AT_type        : <0xaec>
 <2><ead>: Abbrev Number: 0
 <1><eae>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <eaf>   DW_AT_byte_size   : 4
    <eaf>   DW_AT_type        : <0x9ef>
 <1><eb3>: Abbrev Number: 17 (DW_TAG_subprogram)
    <eb4>   DW_AT_external    : 1
    <eb4>   DW_AT_name        : (indirect string, offset: 0x836e5): HAL_I2C_Mem_Write
    <eb8>   DW_AT_decl_file   : 8
    <eb8>   DW_AT_decl_line   : 567
    <eba>   DW_AT_decl_column : 19
    <eba>   DW_AT_prototyped  : 1
    <eba>   DW_AT_type        : <0xaa4>
    <ebe>   DW_AT_declaration : 1
    <ebe>   DW_AT_sibling     : <0xee6>
 <2><ec2>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <ec3>   DW_AT_type        : <0xee6>
 <2><ec7>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <ec8>   DW_AT_type        : <0x900>
 <2><ecc>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <ecd>   DW_AT_type        : <0x900>
 <2><ed1>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <ed2>   DW_AT_type        : <0x900>
 <2><ed6>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <ed7>   DW_AT_type        : <0xe70>
 <2><edb>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <edc>   DW_AT_type        : <0x900>
 <2><ee0>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <ee1>   DW_AT_type        : <0x911>
 <2><ee5>: Abbrev Number: 0
 <1><ee6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ee7>   DW_AT_byte_size   : 4
    <ee7>   DW_AT_type        : <0xe7a>
 <1><eeb>: Abbrev Number: 25 (DW_TAG_subprogram)
    <eec>   DW_AT_external    : 1
    <eec>   DW_AT_name        : (indirect string, offset: 0x346d0): HAL_Delay
    <ef0>   DW_AT_decl_file   : 9
    <ef1>   DW_AT_decl_line   : 296
    <ef3>   DW_AT_decl_column : 6
    <ef4>   DW_AT_prototyped  : 1
    <ef4>   DW_AT_declaration : 1
    <ef4>   DW_AT_sibling     : <0xefe>
 <2><ef8>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <ef9>   DW_AT_type        : <0x911>
 <2><efd>: Abbrev Number: 0
 <1><efe>: Abbrev Number: 17 (DW_TAG_subprogram)
    <eff>   DW_AT_external    : 1
    <eff>   DW_AT_name        : (indirect string, offset: 0x83a28): HAL_I2C_Mem_Read
    <f03>   DW_AT_decl_file   : 8
    <f03>   DW_AT_decl_line   : 568
    <f05>   DW_AT_decl_column : 19
    <f05>   DW_AT_prototyped  : 1
    <f05>   DW_AT_type        : <0xaa4>
    <f09>   DW_AT_declaration : 1
    <f09>   DW_AT_sibling     : <0xf31>
 <2><f0d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <f0e>   DW_AT_type        : <0xee6>
 <2><f12>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <f13>   DW_AT_type        : <0x900>
 <2><f17>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <f18>   DW_AT_type        : <0x900>
 <2><f1c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <f1d>   DW_AT_type        : <0x900>
 <2><f21>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <f22>   DW_AT_type        : <0xe70>
 <2><f26>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <f27>   DW_AT_type        : <0x900>
 <2><f2b>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <f2c>   DW_AT_type        : <0x911>
 <2><f30>: Abbrev Number: 0
 <1><f31>: Abbrev Number: 15 (DW_TAG_subprogram)
    <f32>   DW_AT_external    : 1
    <f32>   DW_AT_name        : (indirect string, offset: 0x83ac8): watchStatus
    <f36>   DW_AT_decl_file   : 1
    <f36>   DW_AT_decl_line   : 55
    <f37>   DW_AT_decl_column : 6
    <f37>   DW_AT_prototyped  : 1
    <f37>   DW_AT_low_pc      : 0
    <f3b>   DW_AT_high_pc     : 0x80
    <f3f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f41>   DW_AT_call_all_tail_calls: 1
    <f41>   DW_AT_sibling     : <0xf8c>
 <2><f45>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <f46>   DW_AT_name        : (indirect string, offset: 0x838c1): M_detected
    <f4a>   DW_AT_decl_file   : 1
    <f4a>   DW_AT_decl_line   : 55
    <f4b>   DW_AT_decl_column : 27
    <f4c>   DW_AT_type        : <0xe70>
    <f50>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><f53>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <f54>   DW_AT_name        : (indirect string, offset: 0x83970): M_low
    <f58>   DW_AT_decl_file   : 1
    <f58>   DW_AT_decl_line   : 55
    <f59>   DW_AT_decl_column : 48
    <f5a>   DW_AT_type        : <0xe70>
    <f5e>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><f61>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <f62>   DW_AT_name        : (indirect string, offset: 0x839c5): M_high
    <f66>   DW_AT_decl_file   : 1
    <f66>   DW_AT_decl_line   : 55
    <f67>   DW_AT_decl_column : 64
    <f68>   DW_AT_type        : <0xe70>
    <f6c>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><f6f>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <f70>   DW_AT_name        : (indirect string, offset: 0x83a39): buff
    <f74>   DW_AT_decl_file   : 1
    <f74>   DW_AT_decl_line   : 55
    <f75>   DW_AT_decl_column : 81
    <f76>   DW_AT_type        : <0xe70>
    <f7a>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><f7d>: Abbrev Number: 10 (DW_TAG_variable)
    <f7e>   DW_AT_name        : (indirect string, offset: 0x8379f): buffer
    <f82>   DW_AT_decl_file   : 1
    <f82>   DW_AT_decl_line   : 56
    <f83>   DW_AT_decl_column : 10
    <f84>   DW_AT_type        : <0x8f4>
    <f88>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><f8b>: Abbrev Number: 0
 <1><f8c>: Abbrev Number: 15 (DW_TAG_subprogram)
    <f8d>   DW_AT_external    : 1
    <f8d>   DW_AT_name        : (indirect string, offset: 0x83980): encGetAngle
    <f91>   DW_AT_decl_file   : 1
    <f91>   DW_AT_decl_line   : 45
    <f92>   DW_AT_decl_column : 6
    <f92>   DW_AT_prototyped  : 1
    <f92>   DW_AT_low_pc      : 0x8000e8c
    <f96>   DW_AT_high_pc     : 0x88
    <f9a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f9c>   DW_AT_call_all_tail_calls: 1
    <f9c>   DW_AT_sibling     : <0xfd9>
 <2><fa0>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <fa1>   DW_AT_name        : (indirect string, offset: 0x8977c): result
    <fa5>   DW_AT_decl_file   : 1
    <fa5>   DW_AT_decl_line   : 45
    <fa6>   DW_AT_decl_column : 25
    <fa7>   DW_AT_type        : <0xfd9>
    <fab>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><fae>: Abbrev Number: 10 (DW_TAG_variable)
    <faf>   DW_AT_name        : (indirect string, offset: 0x8379f): buffer
    <fb3>   DW_AT_decl_file   : 1
    <fb3>   DW_AT_decl_line   : 46
    <fb4>   DW_AT_decl_column : 10
    <fb5>   DW_AT_type        : <0xfe5>
    <fb9>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><fbc>: Abbrev Number: 10 (DW_TAG_variable)
    <fbd>   DW_AT_name        : (indirect string, offset: 0x8c064): angle
    <fc1>   DW_AT_decl_file   : 1
    <fc1>   DW_AT_decl_line   : 47
    <fc2>   DW_AT_decl_column : 11
    <fc3>   DW_AT_type        : <0x900>
    <fc7>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><fca>: Abbrev Number: 10 (DW_TAG_variable)
    <fcb>   DW_AT_name        : (indirect string, offset: 0x837f6): angle_deg
    <fcf>   DW_AT_decl_file   : 1
    <fcf>   DW_AT_decl_line   : 50
    <fd0>   DW_AT_decl_column : 8
    <fd1>   DW_AT_type        : <0xfde>
    <fd5>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><fd8>: Abbrev Number: 0
 <1><fd9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <fda>   DW_AT_byte_size   : 4
    <fda>   DW_AT_type        : <0xfde>
 <1><fde>: Abbrev Number: 6 (DW_TAG_base_type)
    <fdf>   DW_AT_byte_size   : 4
    <fe0>   DW_AT_encoding    : 4	(float)
    <fe1>   DW_AT_name        : (indirect string, offset: 0x88742): float
 <1><fe5>: Abbrev Number: 26 (DW_TAG_array_type)
    <fe6>   DW_AT_type        : <0x8f4>
    <fea>   DW_AT_sibling     : <0xff5>
 <2><fee>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <fef>   DW_AT_type        : <0x8ed>
    <ff3>   DW_AT_upper_bound : 1
 <2><ff4>: Abbrev Number: 0
 <1><ff5>: Abbrev Number: 15 (DW_TAG_subprogram)
    <ff6>   DW_AT_external    : 1
    <ff6>   DW_AT_name        : (indirect string, offset: 0x839b8): encChangeDir
    <ffa>   DW_AT_decl_file   : 1
    <ffa>   DW_AT_decl_line   : 35
    <ffb>   DW_AT_decl_column : 6
    <ffb>   DW_AT_prototyped  : 1
    <ffb>   DW_AT_low_pc      : 0
    <fff>   DW_AT_high_pc     : 0x38
    <1003>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1005>   DW_AT_call_all_tail_calls: 1
    <1005>   DW_AT_sibling     : <0x1019>
 <2><1009>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <100a>   DW_AT_name        : dir
    <100e>   DW_AT_decl_file   : 1
    <100f>   DW_AT_decl_line   : 35
    <1010>   DW_AT_decl_column : 27
    <1011>   DW_AT_type        : <0x8f4>
    <1015>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><1018>: Abbrev Number: 0
 <1><1019>: Abbrev Number: 15 (DW_TAG_subprogram)
    <101a>   DW_AT_external    : 1
